let sourceData = [
     {
      "Місяць": "Січень",
      "Дата": "8 січня",
      "Заголовок": "Ярослав Гайвас",
      "Стаття": "Один з провідних діячів ОУН, входив до складу крайової екзекутиви ОУН. Член ПУН. Після розколу, залишився на стороні Голови ПУН полковника А. Мельника. Відповідно до українського законодавства може бути зарахований до борців за незалежність України у ХХ сторіччі",
      "Імя форми": "Ярослав Гайвас: Відданість і Боротьба",
      "Стаття форми": "Ярослав Гайвас — один із провідних діячів Організації українських націоналістів (ОУН), який зіграв значну роль у національно-визвольному русі України. Народився у 1911 році в селі Піщанка на Тернопільщині. З юних років виявляв інтерес до націоналістичних ідей і став активним учасником ОУН. Завдяки своїм організаційним здібностям та вірності ідеалам боротьби за незалежність України, Гайвас швидко піднявся в ієрархії ОУН і увійшов до складу крайової екзекутиви ОУН, керуючи підпільною діяльністю на західноукраїнських землях.Після Другої світової війни Гайвас продовжував свою боротьбу в лавах ОУН, ставши членом Проводу українських націоналістів (ПУН). Він активно працював над координацією дій націоналістичного підпілля, зокрема у сфері пропаганди та зв’язків з українською діаспорою. Гайвас займався публіцистичною діяльністю, виступаючи за необхідність продовження боротьби за незалежність України навіть в умовах радянської окупації. Його відданість справі та внесок у націоналістичний рух зробили його однією з ключових фігур в історії українського визвольного руху.",
      "Посилання": "Енциклопедія сучасної України&https://esu.com.ua/article-28176|Життєпис Ярослава Гайваса&http://surl.li/uggdc|Як не видати себе ворогу. Вісім правил конспірації українського підпільника&https://localhistory.org.ua/texts/statti/iak-ne-vidati-sebe-vorogu-visim-pravil-konspiratsiyi-ukrayinskogo-pidpilnika/",
      "Фото": "Гавайс_Ярослав_big.png|Гавайс_Ярослав_small.png"
     },
     {
      "Місяць": "Січень",
      "Дата": "10 січня",
      "Заголовок": "Грицак Осип Теодорович",
      "Стаття": "Грицак Осип Теодорович, народжений 10 січня 1905 року, був крайовим провідником Організації українських націоналістів (ОУН) у березні-квітні 1940 року. За короткий період свого керівництва, він зумів організувати та активізувати підпільну діяльність ОУН на західноукраїнських землях. Його діяльність сприяла зміцненню націоналістичного руху в умовах радянської окупації.",
      "Імя форми": "Осип Грицак: Лідер Підпілля ОУН",
      "Стаття форми": "Грицак Осип Теодорович, народжений 10 січня 1905 року, був важливою фігурою в Організації українських націоналістів (ОУН) і обіймав посаду крайового провідника протягом березня-квітня 1940 року. Він керував підпільною діяльністю ОУН на західноукраїнських землях в період, коли регіон був під радянською окупацією. Під його керівництвом організація продовжувала боротьбу за незалежність України, незважаючи на жорстокі репресії з боку радянської влади. Грицак був відомий своєю здатністю до мобілізації ресурсів і людей, що дозволило ОУН ефективно діяти навіть в умовах суворого підпілля.Хоча його перебування на посаді крайового провідника було відносно коротким, Осип Грицак зробив значний внесок у розвиток та зміцнення українського націоналістичного руху. Він займався організацією та координацією діяльності підпільних груп, забезпечуючи зв’язок між різними осередками ОУН і підтримуючи моральний дух членів організації. Його робота допомогла закласти основу для подальших дій ОУН у боротьбі за українську незалежність, що продовжувалася протягом усього періоду радянської окупації.",
      "Посилання": "Життєпис Осипа Грицака&http://surl.li/uggfy",
      "Фото": "Грицак_Осип_big.png | Грицак_Осип_small.png"
     },
     {
      "Місяць": "Січень",
      "Дата": "11 січня",
      "Заголовок": "Васи́ль Степа́нович Кук",
      "Стаття": "Васи́ль Степа́нович Кук народився 11 січня 1913 року. Василь - український військовий діяч, один із керівників українського національно-визвольного руху, генерал-хорунжий, командир УПА-південь, 2-й Голова Генерального Секретаріату УГВР (1950–1954), головнокомандувач УПА з 1950 по 1954 роки (після загибелі Романа Шухевича).",
      "Імя форми": "Василь Кук: Провідник УПА",
      "Стаття форми": "Василь Степанович Кук, народжений 11 січня 1913 року, був видатним українським військовим і політичним діячем, одним із провідних членів ОУН. Він народився в селі Красне на Львівщині, де з ранніх років приєднався до націоналістичного руху. Кук став активним учасником підпільної боротьби за незалежність України, відіграючи ключову роль в організації опору радянській і німецькій окупаціям під час Другої світової війни. Його відданість справі та стратегічні здібності привели його до керівних посад в УПА, де він обіймав посаду головного командира після загибелі Романа Шухевича у 1950 році.Після війни, у період радянської окупації, Василь Кук продовжував боротися за свободу України, очолюючи підпільну діяльність ОУН і УПА. Його діяльність включала організацію партизанських операцій, пропаганду та підтримку націоналістичного руху серед населення. У 1954 році Кук був захоплений радянськими органами безпеки і провів кілька років у в'язницях. Після звільнення він відійшов від активної політичної діяльності, але залишався символом стійкості і незламного духу українського визвольного руху.",
      "Посилання": " Василь Кук: життя й боротьба останнього головного командира УПА&http://surl.li/uggkm|Український інститут національної пам’яті&http://surl.li/uggkp|Василь Кук – останній командарм УПА&http://surl.li/uggku|",
      "Фото": "Василь_Кук_big.png | Василь_Кук_small.png"
     },
     {
      "Місяць": "Січень",
      "Дата": "15 січня",
      "Заголовок": "Яків Чорній",
      "Стаття": "Яків народився 15 січня 1914 с. Хишевичі, Городоцький район, Львівська область — 24 грудня 1944 — поблизу Кальварія Пацлавська, Підкарпатське воєводство, Польща) — військовий діяч УПА, хорунжий, перший командир Військової округи-6 «Сян», яка належала до оперативної групи УПА-Захід.",
      "Імя форми": "Яків Чорній: Незламний Герой України",
      "Стаття форми": "Яків Чорній, народжений 15 січня 1914 року, був визначним українським військовим і політичним діячем, активним учасником національно-визвольного руху. В юності він приєднався до Організації українських націоналістів (ОУН), де швидко здобув репутацію відданого і здібного борця за незалежність України. Його діяльність у складі ОУН включала організацію підпільних осередків, проведення пропагандистської роботи та участь у збройних акціях проти окупаційних режимів. Чорній виявляв неабиякі лідерські якості та здатність до стратегічного мислення, що зробило його важливою фігурою у націоналістичному русі.Під час Другої світової війни Яків Чорній активно боровся як проти нацистської, так і проти радянської окупації, залишаючись вірним ідеалам незалежної України. Після війни, незважаючи на жорстокі репресії з боку радянської влади, він продовжував свою діяльність у підпіллі, керуючи операціями та підтримуючи зв'язок між різними групами опору. Чорній був відомий своєю невтомністю і стійкістю, що допомогло підтримувати моральний дух українських націоналістів у найважчі часи. ",
      "Посилання": 'Яків Чорній - «Ударник; Куля; Мушка»&http://surl.li/uggjk|«Ой там, ой там за двором…»&http://surl.li/uggjs|Програма "Наші Герої" - Яків Чорній&http://surl.li/uggkb',
      "Фото": "Яків_Чорний__big.png | Яків_Чорний__small.png"
     },
     {
      "Місяць": "Лютий",
      "Дата": "2 лютого",
      "Заголовок": "Дякон Ярослав Андрійович",
      "Стаття": "Дякон Ярослав народився 2 лютого 1913 року. Ярослав -  визначний діяч ОУН, майор СБ, референт СБ Львівської області (1942—1948), в.о. голови СБ ОУН (01.1947-11.1948). Борець за незалежність України у ХХ сторіччі. Лицар Срібного Хреста Заслуги (1947).",
      "Імя форми": "Дякон Ярослав - Душа Боротьби та Служіння",
      "Посилання": "Дякон Ярослав, організатор ОУН на Бібреччині&http://surl.li/uggmi|Референт Служби безпеки Проводу ОУН(б), полковник СБ Ярослав Дякон&http://surl.li/uggmp|Життєпис Ярослава Дякона&http://surl.li/uggms",
      "Фото": "Дякон_Ярослав_big.png | Дякон_Ярослав_small.png"
     },
     {
      "Місяць": "Лютий",
      "Дата": "6 лютого",
      "Заголовок": "Левкович Василь Михайлович",
      "Стаття": "Левкович Василь Михайлович народився 6 лютого 1920 року. Василь - український військовий діяч, полковник Української повстанської армії, командир військового округу «Буг» — частини оперативної групи УПА-Захід (червень 1944 — до арешту 17 грудня 1946). Політв'язень радянський концтаборів. Провів в ув'язнені 25 років. Був реабілітований у 1997 році. Лицар Золотого Хреста Бойової Заслуги 2-го класу. Почесний громадянин міста Червнограда.",
      "Імя форми": "Василь Левкович: Доля Людини та Борця за Волю",
      "Стаття форми": "Левкович Василь Михайлович народився 6 лютого 1920 року в сім'ї працівників, укорінених у львівській землі. Його дитинство і юність співпали з періодом перетворень та нестабільності, що характеризували міжвоєнний період в Україні. Захоплення ідеями національної самостійності зміцнило в ньому впевненість у необхідності боротьби за свободу свого народу.У 1941 році, коли нацистська Німеччина окупувала Львів, Василь Левкович приєднався до підпільної організації, що протистояла нацистському режиму. Пізніше, під владою радянських окупантів, він активно долучився до боротьби за незалежність та свободу своєї країни, ставши одним із визначних діячів українського опору в умовах тоталітарного режиму.",
      "Посилання": 'Український інститут національної пам’яті&http://surl.li/uggnf|Хто може — нехай зробить краще" — командир УПА, який помирав тричі&http://surl.li/uggnh|Василь Левкович – останній полковник УПА&http://surl.li/uggnk',
      "Фото": "Левкович_Василь_big.png | Левкович_Василь_small.png"
     },
     {
      "Місяць": "Лютий",
      "Дата": "23 лютого",
      "Заголовок": "Петро Миколайович Федун-Полтава",
      "Стаття": "Петро Микола́йович Федун-Полтава народився 23 лютого 1919 року - заступник Голови Генерального Секретаріату Української Головної Визвольної Ради, член ОУН і член Проводу ОУН, керівник Головного осередку пропаганди Проводу ОУН, референт політвиховного відділу Головного військового штабу УПА і керівник Бюро інформації УГВР; «чоловий» (головний) ідеолог («політвиховник») українського збройного підпілля ОУН-УПА 1940—1950-х років, пропагандист, публіцист і редактор та автор багатьох повстанських публікацій.",
      "Імя форми": "Петро Миколайович Федун-Полтава: Вояк і Патріот",
      "Стаття форми": "Петро Миколайович Федун-Полтава народився 23 лютого 1919 року в сім'ї селян у мальовничому куточку України. Його дитинство припало на трагічний період історії країни, коли Україна переживала військові конфлікти та періоди політичних переворотів. З 1941 по 1945 рік, під час Другої світової війни, він став активним учасником опору проти нацистської окупації на території України, долаючи випробування та ризикуючи життям заради свободи та незалежності своєї країни.Після війни, у період з 1946 по 1950 рік, Петро Миколайович продовжував свою боротьбу за ідеали вільної України, долучаючись до підпільних структур українського національного опору. Його внесок у підтримку національних інтересів та відданість ідеалам незалежності залишалися невимовними. Визнаний як символ мужності та героїзму, він став натхненням для багатьох і вклався в історію боротьби за свободу українського народу.",
      "Посилання": "Петро Полтава - ідеолог українського націоналізму&http://surl.li/uggol|Український інститут національної пам’яті&https://uinp.gov.ua/istorychnyy-kalendar/lyutyy/23/1919-narodyvsya-petro-fedun-politvyhovnyk-pidrozdiliv-upa|Петро Федун-Полтава - «збройний» журналіст-публіцист&http://surl.li/uggox",
      "Фото": "Федун_Петро_big.png | Федун_Петро_small.png"
     },
     {
      "Місяць": "Лютий",
      "Дата": "24 лютого",
      "Заголовок": "Василь Дмитрович Сидор",
      "Стаття": "Василь Дмитрович Сидор народився 24 лютого 1910 - полковник УПА, командир оперативної групи УПА-Захід (26 січня 1944 — квітень 1949), крайовий провідник ОУН Карпатського краю, Генеральний суддя ОУН, заступник головного командира УПА.",
      "Імя форми": "Василь Дмитрович Сидор: Життя, присвячене боротьбі за волю",
      "Стаття форми": "Василь Дмитрович Сидор народився 24 лютого 1910 року із вогнем патріотизму в серці. Його дитинство і молодість припали на період бурхливих подій української історії. З 1939 до 1941 року, він активно долучився до боротьби проти радянської окупації на Західній Україні, виступаючи за незалежність та свободу свого народу.Після нападу на Україну німецьких військ у червні 1941 року, Василь Дмитрович приєднався до підпільних структур Української Повстанської Армії (УПА), де він став одним з провідних діячів. У період з 1942 по 1945 рік, він активно координував операції опору проти нацистської окупації, виявляючи величезну мужність і відданість ідеалам волі та незалежності.",
      "Посилання": "Український інститут національної пам’яті&http://surl.li/uggqx|Василь Сидор - командир УПА-Захід&http://surl.li/uggqy|Василь Сидор – “Шелест” – незламний борець за Україну&http://surl.li/uggra",
      "Фото": "Василь_Сидор_big.png | Василь_Сидор_small.png"
     },
     {
      "Місяць": "Березень",
      "Дата": "17 березня",
      "Заголовок": "Врублевський Зенон Іванович",
      "Стаття": "Підпільник ОУН, вояк дивізії «Галичина» та Української Повстанської Армії.В боях під Бродами потрапив до полону та був вивезений до концтабору в Пермській області. Заарештований в 1947 році та засуджений до 25 років та 5 років позбавлення в правах із конфіскацією майна. Разом із Михайлом Бендиною брав участь у створенні Галицького Братства колишніх вояків 1-ї УД «Галичина» УНА.",
      "Імя форми": "Зенон Врублевський: Сила і натхнення",
      "Стаття форми": "Зенон Іванович Врублевський народився 17 березня 1927 року у Львові. Він був підпільником ОУН, вояком дивізії «Галичина» та Української Повстанської Армії (УПА). Зенон закінчив шість класів приватної школи імені Тадеуша Костюшка у Львові, де активно цікавився українською історією та літературою. У 1944 році, у віці 17 років, він добровільно вступив до дивізії «Галичина». Після розгрому дивізії під Бродами в липні 1944 року, Врублевський боровся у складі УПА. У 1947 році його було заарештовано та засуджено до 25 років таборів, покарання відбував у Свердловську, Кемерово і Воркуті. Повернувся до Львова у 1960 році після звільнення.Після повернення до Львова, Врублевський продовжив активну громадську діяльність. Разом із Михайлом Бендиною він був одним із засновників Галицького Братства колишніх вояків 1-ї УД «Галичина». Він також був активним учасником численних зустрічей ветеранів та історичних подій, присвячених пам'яті дивізії «Галичина».",
      "Посилання": "Зенон Врублевський, доброволець дивізії \"Галичина\", Гайделяґер&http://surl.li/uggsh|“Нас визволили, і нема на то ради”. Як відбувалась окупація Галичини \"першими совітами\"&http://surl.li/uggsk",
      "Фото": "Врублевський_Зенон_big.png | Врублевський_Зенон_small.png"
     },
     {
      "Місяць": "Березень",
      "Дата": "18  березня",
      "Заголовок": "Кирило Григорович Розумовський",
      "Стаття": "Український військовий, політичний та державний діяч, останній гетьман Війська Запорозького. Граф та генерал-фельдмаршал Російської імперії. Кирило Розумовський намагався перебудувати Гетьманщину на європейський лад. За гетьманування Кирила Розумовського Гетьманщину було поділено на повіти, запроваджено систему шляхетських судів — земських, ґродських і підкоморських. ",
      "Імя форми": "Кирило Розумовський: Останній гетьман України",
      "Стаття форми": "Кирило Григорович Розумовський (29 березня 1728 — 9 січня 1803) був останнім гетьманом України, визначною особистістю у політичному житті XVIII століття. У 1750 році Кирило Розумовський був призначений гетьманом Лівобережної України імператрицею Єлизаветою Петрівною. Його правління відзначалося численними реформами, зокрема у сфері адміністрації, судочинства та військової організації. Він намагався модернізувати армію, запровадив нові податки і здійснив судову реформу. Під його керівництвом відбулася реконструкція Батурина, який став столицею Гетьманщини. Розумовський підтримував розвиток освіти та науки, заснувавши першу в Україні світську академію.Кирило Розумовський залишив значний слід в історії України. Він був не тільки політичним діячем, але й меценатом, який сприяв розвитку української культури і науки. Його діяльність мала великий вплив на формування української національної свідомості та збереження козацьких традицій.",
      "Посилання": "1728 - народився Кирило Розумовський, останній гетьман Лівобережної України&http://surl.li/uggtn|Кирило Розумовський — останній правитель України доби Гетьманщини&http://surl.li/uggtr|Яким був гетьман Кирило Розумовський? Кирило Розумовський Історія History&http://surl.li/uggtv",
      "Фото": "Розумовський_Кирило_big.png | Розумовський_Кирило_small.png"
     },
     {
      "Місяць": "Березень",
      "Дата": "20 березня",
      "Заголовок": "Іван Мазепа",
      "Стаття": "Український військовий, політичний і державний діяч. Гетьман Війська Запорозького, голова козацької держави на Лівобережній (1687—1704) і всій Наддніпрянській Україні (1704—1709). Князь Священної Римської імперії (1707—1709). Представник шляхетського роду Мазеп-Колединських герба Курч із Київщини.",
      "Імя форми": "Іван Мазепа: Гетьман і Доля України",
      "Стаття форми": "Іван Степанович Мазепа — визначний український політичний та військовий діяч, гетьман Війська Запорозького. Його діяльність справила значний вплив на українську історію та культуру. У 1687 році Іван Мазепа був обраний гетьманом Лівобережної України. Його правління відзначалося економічними та культурними реформами, спрямованими на зміцнення гетьманської влади та розвитку української державності. Мазепа активно підтримував мистецтво та науку, заснував численні церкви, школи та культурні інституції.Мазепа намагався забезпечити автономію України в складі Російської імперії, але його плани натрапили на опір з боку московського уряду. Після підписання таємної угоди з шведським королем Карлом XII у 1708 році, Мазепа приєднався до шведів у боротьбі проти Росії під час Великої Північної війни. Кульмінацією його боротьби стала Полтавська битва 1709 року, де війська Карла XII та Мазепи зазнали поразки від армії Петра I. Після поразки Мазепа втік до Молдови, де помер у вигнанні.",
      "Посилання": "Іван Мазепа. Біографія. Історія України&http://surl.li/ugguq|Іван Мазепа, гетьман України&http://surl.li/uggus|Іван Мазепа та Печерськ: киянам розповіли маловідомі факти про українського Гетьмана&http://surl.li/ugguw",
      "Фото": "Мазепа_Іван_big.png | Мазепа_Іван_small.png"
     },
     {
      "Місяць": "Березень",
      "Дата": "27 березня",
      "Заголовок": "Іва́н Виго́вський",
      "Стаття": "Український військовий, політичний і державний діяч. Гетьман Війська Запорозького, голова козацької держави у Наддніпрянській Україні (1657-1659), Великий гетьман Руський (1658—1659). Представник православного шляхетського роду Виговських гербу Абданк.",
      "Імя форми": "Іван Виговський: Відданість та Боротьба за Українську Державність",
      "Стаття форми": "Іван Виговський — це постать, яка має значний вплив на культурний та політичний розвиток країни. Він був видатним полководцем, дипломатом і гетьманом. Народився приблизно в 1574 році. Його родина мала помітний вплив на політичну арену того часу, що допомогло Іванові Виговському отримати освіту і навчитися дипломатії.Одним з найвідоміших подій у його житті було становлення на посаді гетьмана Лівобережної України. Іван Виговський активно брав участь у боротьбі за незалежність українського народу від польсько-литовського панування. Він був одним із головних організаторів Хмельниччини, визнаного гетьмана його обраного на Чигиринському з'їзді 1654 року. Під час свого правління він зміцнив владу гетьмана, уклавши важливі договори із закордонними державами та розвиваючи соціально-економічні структури країни.",
      "Посилання": "Іван Виговський. Біографія. Історія України&http://surl.li/uggvx|Іван Остапович Виговський – державний, політичний, військовий діяч, гетьман України : 360 років від дня загибелі&http://surl.li/uggwj",
      "Фото": "Виговський_Іван_big.png | Виговський_Іван_small.png"
     },
     {
      "Місяць": "Березень",
      "Дата": "31 березня",
      "Заголовок": "Міхновський Микола Іванович",
      "Стаття": "Український політичний та громадський діяч кінця XIX — початку XX століття. Адвокат, публіцист, ідеолог українського самостійництва, перший представник українського націоналізму, діяч Української Республіки і організатор українського війська, прихильник дерусифікації та автокефалії Православної Церкви в Україні.",
      "Імя форми": "Міхновський Микола Іванович: Гетьманський Лідер та Дипломат",
      "Стаття форми": "Міхновський Микола Іванович (1620–1688) — видатний український політичний та військовий діяч періоду другої половини XVII століття. Він був представником однієї з найвпливовіших родин України того часу та головою Запорозької Січі. Міхновський відзначався відвагою та високими організаторськими здібностями. Він активно брав участь у визвольних змаганнях українського народу від польсько-литовського панування та розвитку гетьманщини. Міхновський здобув популярність завдяки своїм воєначальницьким талантам, відвагою та лідерськими якостями. У 1669 році Міхновський був обраний гетьманом Запорозької Січі, і його правління характеризувалося спробами посилення внутрішнього порядку та збільшення автономії Січі. Він також відіграв важливу роль у зміцненні обороноздатності українських територій від зовнішніх загроз. Залишивши пам'ять про себе як про видатного гетьмана та визначну постать в історії України, яка відіграла важливу роль у боротьбі за національну незалежність та розвиток української державності.",
      "Посилання": "Микола Міхновський, ідеолог самостійництва&http://surl.li/uggwo|Енциклопедічна стаття Міхновський Микола Іванович&https://esu.com.ua/article-67984",
      "Фото": "Міхновський_Микола_big.png | Міхновський_Микола_small.png"
     },
     {
      "Місяць": "Квітень",
      "Дата": "1 квітня",
      "Заголовок": "Дмитро Грицай-Перебийніс",
      "Стаття": "Дмитро Грицай-Перебийніс народився 1 квітня 1907 -  український політичний і військовий діяч, референт Крайової екзекутиви ОУН на західноукраїнських землях у 1933–1934 рр., генерал-хорунжий УПА, з січня 1944 року начальник її головного штабу.",
      "Імя форми": "Дмитро Грицай-Перебийніс",
      "Стаття форми": "Дмитро Грицай-Перебийніс народився 1 квітня 1907 року, у роки, коли Україна входила в склад Російської імперії. Його доросле життя відзначилося невичерпним патріотизмом та відданістю ідеалам свободи. З 1928 по 1932 рік, він активно долучився до підпільної діяльності проти радянської влади, борючись за незалежність та права українського народу.Після початку Другої світової війни, у 1941 році, Дмитро приєднався до українського національного опору, де він став одним з ключових лідерів. У період з 1943 по 1945 рік, він координував ряд успішних операцій проти нацистської окупації, демонструючи величезну мужність і самовідданість у боротьбі за свободу та незалежність України.",
      "Посилання": "Український інститут національної памяті&http://surl.li/uggzm|Основні дати з життя Дмитра&http://surl.li/uggzo|Дмитро Грицай – Начальник Головного Військового штабу УПА&http://surl.li/uggzr",
      "Фото": "Грицай_Дмитро_big.png | Грицай_Дмитро_small.png"
     },
     {
      "Місяць": "Квітень",
      "Дата": "8 квітня",
      "Заголовок": "Павло Тетеря",
      "Стаття": "Павло Тетеря - (1620/1622—1670) — український дипломат, військовий і політичний діяч. Був гетьманом Війська Запорозького та головою козацької держави Правобережної України (1663–1665). До 1648 року працював писарем у Володимирі, а згодом став писарем Переяславського полку Гетьманщини та полковником Переяслава. В 1654 році він був у складі українського посольства в Москві, що оформляло Переяславську угоду. Як гетьман, він прагнув скасувати унію України з московським монархом, реалізуючи відповідну політику. Також відомий як секретар короля та полоцький стольник.",
      "Імя форми": "Павло Тетеря: Життя та Діяльність",
      "Стаття форми": "Павло Тетеря (1620/1622—1670) — видатний український діяч XVII століття, чиє життя та діяльність були вкрай значущими для історії України. Він народився між 1620 і 1622 роками, із родовим прізвищем Тетеренко, але також відомий як Павло Мошковський гербу Радван або Сліповрон.У 1663-1665 роках Павло Тетеря обіймав посади гетьмана Війська Запорозького та голови козацької держави Правобережної України. Його життя та кар'єра були пов'язані з важливими подіями того часу, від Хмельниччини до початку Московського патріархату. Його роль у визначних історичних подіях та зусилля для збереження української самостійності відіграли визначну роль у формуванні сучасної національної свідомості.",
      "Посилання": "Гетьман Павло Тетеря&http://surl.li/ughah|Козаки. Історії лицарства&http://surl.li/ughal|Павло Тетеря, Гетьман Правобережної України&http://surl.li/ugham|Тіньовий гетьман Павло Тетеря комік+історик&http://surl.li/ughas",
      "Фото": "Тетеря_Павло_big.png | Тетера_Павло_small.png"
     },
     {
      "Місяць": "Квітень",
      "Дата": "11 квітня",
      "Заголовок": "Северин Наливайко",
      "Стаття": "Северин Наливайко - видатний козацький гетьман, чиє життя виповнене подіями, що визначили хід української історії. Один із керівників повстання 1594—1596 років у Речі Посполитій. ",
      "Імя форми": "Северин Наливайко: Гетьман Козацького Духу",
      "Стаття форми": "Северин Наливайко був відомим керівником козацького повстання в період з 1591 по 1596 роки. Народився в містечку Гусятин (сьогодні смт. Тернопільської області), але, ймовірно, зростав в Острозі та отримав освіту в Острозькій слов’яно-греко-латинській школі.Під час свого життя Наливайко брав участь у численних походах та війнах, що відбувалися у різні періоди. Він відзначався винятковою хоробрістю та фізичною силою. Під час своєї діяльності він зібрав значний загін для оборони від татар, зруйнував турецькі фортеці та взяв участь у численних походах на території Речі Посполитої та Молдови. Також він активно листувався з польським королем та пропагував ідею створення особливої території для козаків. В квітні 1596 року він був обраний гетьманом, але пізніше потрапив до полону і був публічно страчений у Варшаві.",
      "Посилання": "Український інститут національної пам’яті&http://surl.li/ughbk|Северин Наливайко і Надвірна. Легенди і факти. Екскурс в історію міста&http://surl.li/ughbn|Війна під булавою Северина Наливайка. Повстання Наливайка та Лободи (1594 - 1596)&http://surl.li/ughbu",
      "Фото": "Наливайко_Северин_big.png | Наливайко_Северин_small.png"
     },
     {
      "Місяць": "Квітень",
      "Дата": "18 квітня",
      "Заголовок": "Івахів Василь Григорович",
      "Стаття": "Івахів Василь Григорович народився 18 квітня 1908 року, с. Подусільна, нині Перемишлянський район, Львівська область, Україна — 13 травня 1943, с. Чорниж, нині Маневицький район, Волинська область) — перший командир УПА на Волині. Підполковник УПА (посмертно). Лицар Золотого Хреста Бойової Заслуги 1-го кл. (посмертно).",
      "Імя форми": "Івахів Василь Григорович: Символ Незламної Волі",
      "Стаття форми": 'Івахів Василь Григорович народився 18 квітня 1908 року, с. Подусільна, нині Перемишлянський район, Львівська область, Україна — 13 травня 1943, с. Чорниж, нині Маневицький район, Волинська область) — перший командир УПА на Волині. Підполковник УПА (посмертно). Івахів Василь Григорович народився 18 квітня 1908 року в с. Подусільна, Перемишлянського району, Львівської області. Закінчив Рогатинську гімназію та старшинську школу польської армії в ранзі поручника, де став активним пластуном. Він відбув службу у Польській армії, здобувши офіцерське звання, та активно працював у громадських організаціях "Сокіл" та "Просвіта". Був арештований та засуджений до ув\'язнення кілька разів, включаючи утримання у концтаборі "Береза Картузька".Учасник військових курсів ОУН(б) у Кракові, він став командиром підстаршинської школи ОУН(б) у містечку Поморяни Львівської області. Після арешту Гестапо він був в\'язнем гітлерівської тюрми. З тюрми викупив його митрополит Андрей Шептицький. Від літа 1942 року він працював військовим референтом проводу ОУН(б) на ПЗУЗ та був членом підпільного військового штабу. Івахів був організатором і першим командиром УПА на Волині, а також активним прихильником співпраці з бульбівцями з метою боротьби проти нацистів.',
      "Посилання": "Творець УПА, ім’я якого замовчували десятиліттями. Чому Василь Івахів залишився в тіні Романа Шухевича? Феномен УПА&http://surl.li/ughch|Життєпис Романа Шухевича&http://surl.li/ughcj",
      "Фото": "Івахів_Василь_big.png | Івахів_Василь_small.png"
     },
     {
      "Місяць": "Квітень",
      "Дата": "20 квітня",
      "Заголовок": "Петро Конашевич-Сагайдачний",
      "Стаття": "Петро Конашевич-Сагайдачний (близько 1582, Кульчиці, нині село Самбірського району Львівської області — 20 квітня 1622, Київ) — український полководець і політичний діяч, православний шляхтич гербу Побуг, гетьман реєстрового козацтва, кошовий отаман Запорізької Січі. Організатор успішних походів запорозьких козаків проти Кримського ханства, Османської імперії та Московського царства. Меценат православних братств та опікун братських шкіл.",
      "Імя форми": "Життя і подвиги Петра Конашевича-Сагайдачного",
      "Стаття форми": "Петро Кононович Конашевич-Сагайдачний — видатний гетьман Війська Запорозького, відомий полководець та політичний діяч. Народився у 1560 році в селі Кульчиці, що на території нинішнього Самбірського району Львівської області. Навчався у Самборі та Острозькій академії. У першій половині XVII століття активно брав участь у походах козаків. Був чотиричи рази обраний гетьманом Війська Запорозького, під час чого здійснив ряд визначних подій, включаючи захоплення Кафи та участь у московському поході під Тушиним.Його діяльність була пов'язана зі зміцненням православ'я та захистом прав українського народу. Він відіграв вагому роль у відновленні православної ієрархії в Україні, брав участь у Хотинській битві проти турків та демонстрував активну підтримку православ'я. Помер у 1622 році від отриманих поранень під час військових дій. Його подвиги відображені в літературі та мистецтві, а пам'ять про нього зберігається у вуличних назвах та історичних документах.",
      "Посилання": "Петро Сагайдачний. Біографія. Історія України&http://surl.li/ughcy|Петро Конашевич Сагайдачний як видатна історична постать&http://surl.li/ughdb|Похід на Москву і Хотинська битва. Як гетьман Петро Сагайдачний порозумівся з поляками&http://surl.li/ughdf",
      "Фото": "Конаше́вич-Сагайда́чний_Петро_big.png | Конаше́вич-Сагайда́чний_Петро_small.png"
     },
     {
      "Місяць": "Травень",
      "Дата": "4 травня",
      "Заголовок": "Кость Гордієнко",
      "Стаття": "Кошовий отаман Війська Запорозького. Він походив із Полтавщини, вчився в Києво-Могилянській академії. Далі доля привела його на Січ, де людина неабияких здібностей мала всі шанси виявити себе. З 1702 по 1728 роки він не раз ставав кошовим і залишив в історії Запоріжжя помітний слід.",
      "Імя форми": "Кость Гордієнко: Волелюбний Воїн та Захисник Свободи",
      "Стаття форми": "Він походив із Полтавщини, вчився в Києво-Могилянській академії. Після навчання подався на Запорізьку Січ, козак Платнирівського куреня. В документах вперше згадується 1696, коли відзначився під час захоплення татарських розвідників. Дванадцять разів обирався кошовим отаманом Запорозької Січі: з перервами у 1702-1709 на Чортомлицькій Січі, 1710-1728 на Кам’янській та Олешківській Січі. Усе життя був непримиренним ворогом Москви та всіма силами обороняв права і вольності Запоріжжя. Саме на хвилі антимосковських настроїв козацтва 1702 вперше обраний кошовим і відтак постійно користувався симпатіями та повагою низовиків. Помер і похований на Кам’янській Січі. Наступного року після його смерті Кам’янська Січ припинила існування. Мав сина Василя, якого після падіння Батурина (1708) московити схопили у Верхньому Салтові й невдовзі він помер. Після Полтавської битви московити викопали мертве тіло Василя, обезголовили та повісили на дереві.",
      "Посилання": "Кость Гордієнко – кошовий отаман Запорозької Січі, засновник та кошовий отаман Кам’янської Січі та Олешківської Січі (290 років тому)&http://surl.li/ughdr|Гордієнко Кость&http://surl.li/ughdv",
      "Фото": "Гордієнко_Кость_big.png | Гордієнко_Кость_small.png"
     },
     {
      "Місяць": "Травень",
      "Дата": "9 травня",
      "Заголовок": "Осьмак Кирило Іванович",
      "Стаття": "Український вчений-аграрій, громадський та політичний діяч національного відродження, діяч Української Центральної Ради, діяч ОУН, голова Підпільного уряду України у 1944, Президент Української Головної Визвольної Ради, Борець за незалежність України у ХХ сторіччі",
      "Імя форми": "Осьмак Кирило Іванович: Від Революційного Лідера до Визначного Дипломата",
      "Стаття форми": "Кирило Іванович Осьмак (9 травня 1890, містечко Шишаки, нині смт Миргородського району Полтавської області - 16 травня 1960, м. Владимир, Російська Федерація) - український діяч національно-визвольного руху. Під час Української революції Осьмак працював у Київській губернській земській управі, пізніше вступив до Української Центральної Ради. Він був керівником відділу з видання сільськогосподарської літератури в Генеральному секретаріаті землеробства, а згодом працював у Міністерстві землеробства.Після перемоги Директорії УНР, Осьмак повернувся на роботу до Міністерства землеробства. У 1928 році його заарештували, а згодом засудили до трирічного ув'язнення. Пізніше він був ще раз засуджений і висланий до Сибіру, де працював і проживав до 1941 року. Після повернення до Києва він був активним учасником національно-визвольного руху, але в 1944 році був знову заарештований.",
      "Посилання": "Кирило Осьмак&http://surl.li/ughfz|Кирило Осьмак – Президент Української Головної Визвольної Ради (до 70-ї річниці створення Української Головної Визвольної Ради)&http://surl.li/ughga",
      "Фото": "Осьмак_Кирило_big.png | Осьмак_Кирило_small.png"
     },
     {
      "Місяць": "Травень",
      "Дата": "10 травня",
      "Заголовок": "Петро́ Дороше́нко",
      "Стаття": "Видатний український військовий, політичний і державний діяч. Гетьман Війська Запорозького Правобережної України (1665—1676), очільник Гетьманщини (1668—1670). Козацький полковник, учасник Хмельниччини та московсько-української війни. Гетьманування, котре припало на добу Руїни, провів у постійних війнах, як із зовнішніми, так і внутрішніми ворогами.",
      "Імя форми": "Петро Дорошенко і боротьба за волю",
      "Стаття форми": "Видатний діяч в історії України, козацький гетьман, який був на посаді з 1665 по 1676 рік. Народився в родині козацького полковника. Почав свою кар'єру як сотник, потім став полковником, а в 1665 році був обраний гетьманом Українського козацтва.Під час свого правління Дорошенко велив важким переговорам і боротьбі за незалежність та стабільність України, конфліктував з російськими та польськими силами. Він також спробував укласти союз з Османською імперією для захисту України від ворогів. Проте його гетьманство завершилося в 1676 році через поразку від російських військ під Чигирином та після цього Дорошенко був змушений втекти від його ворогів, зокрема до Туреччини. Після втрати посади гетьмана, Петро Дорошенко продовжував діяти у політиці, проте його вплив значно зменшився. Він помер у вигнанні в 1698 році. Дорошенко залишив по собі слід у козацькій історії, визнаний як один із символів боротьби за незалежність України в XVII столітті.",
      "Посилання": "Політика гетьмана Петра Дорошенка&http://surl.li/ughgp|Османська Україна Петра Дорошенка&https://armyinform.com.ua/2021/11/09/osmanska-ukrayina-petra-doroshenka|«Дорошенко Петро. Державник у Добу Руїни»&https://msmb.org.ua/biblioresursi/bibliografiya/osobistosti/doroshenko-petro-derzhavnik-u-dobu-ruini/",
      "Фото": "Дорошенко_Петро_big.png | Дорошенко_Петро_small.png"
     },
     {
      "Місяць": "Травень",
      "Дата": "15 травня",
      "Заголовок": "Скоропадський Павло Петрович",
      "Стаття": "Гетьман України, український державний, політичний і громадський діяч, військовик. Походив із козацько-старшинського роду Скоропадських[3]. Офіцер Російської імператорської армії. Учасник російсько-японської, Першої світової війни та радянсько-української війни. Гетьман Української Держави (29 квітня — 14 грудня 1918) Відповідно до українського законодавства може бути зарахований до борців за незалежність України у ХХ сторіччі.",
      "Імя форми": "Життя та Діяльність Павла Петровича Скоропадського",
      "Стаття форми": "Павло Петрович Скоропадський (1873-1945) - відомий український державний діяч та генерал-отаман, який відіграв значну роль у складному періоді історії України в першій половині XX століття. Під час Першої світової війни Скоропадський очолював добре відомий Український корпус і відзначився на багатьох фронтах. Після Революції 1917 року та визнання незалежності України він приєднався до національно-демократичного руху та був обраний гетьманом Української Держави 29 квітня 1918 року.Його уряд протримався лише впродовж восьми місяців через опозицію різних політичних сил, а також через втручання іноземних держав, зокрема Центральних держав та Російської РСФР. В результаті Скоропадський був змушений відступити та емігрувати до Німеччини.",
      "Посилання": "Павло Скоропадський  Біографія  Цікаві факти&https://www.youtube.com/watch?v=JqknHoW0QAs|Павло Скоропадський – гетьман-українізатор, якого погубило русофонство&https://www.radiosvoboda.org/a/30460976.html",
      "Фото": "Скоропадський_Павло_big.png | Скоропадський_Павло_small.png"
     },
     {
      "Місяць": "Травень",
      "Дата": "22 травня",
      "Заголовок": "Си́мон Васи́льович Петлю́ра",
      "Стаття": "Український державний, військовий та політичний діяч, публіцист, літературний і театральний критик. Член Генерального секретаріату Української Центральної Ради на посаді Генерального секретаря з військових справ (28 червня — 31 грудня 1917). Політв'язень при владі Павла Скоропадського (27 липня — 12 листопада 1918). Головний отаман військ Української Народної Республіки (УНР) (з листопада 1918). 2-й Голова Директорії УНР (9 травня 1919 — 10 листопада 1920).",
      "Імя форми": "Життя і Діяльність Гетьмана Української Народної Республіки",
      "Стаття форми": "Симон Васильович Петлюра (1879–1926) був видатним українським політиком і військовим діячем, який відіграв ключову роль у становленні та боротьбі за незалежність України в період між першою та другою світовими війнами. Під час Першої світової війни Петлюра виступав на стороні Російської армії, де займав відповідальні пости в українських військових підрозділах.Після революційних подій 1917 року він став одним із головних лідерів Української Центральної Ради та Української Народної Республіки. Петлюра очолив Українську Народну Армію в боротьбі проти більшовицьких та військових сил Директорії, прагнучи забезпечити незалежність України. Його спадок як героя та лідера боротьби за українську незалежність залишається значущим для українського національного руху.",
      "Посилання": "Неоднозначна постать чи національний герой. Симон Петлюра&http://surl.li/ugznc|Симон Петлюра, Голова Директорії, Головний Отаман військ і флоту УНР&http://surl.li/ugzne|Симон Петлюра – ворог більшовиків та символ боротьби українців&http://surl.li/ugzng",
      "Фото": "Петлюра_Симон_big.png | Петлюра_Симон_small.png"
     },
     {
      "Місяць": "Червень",
      "Дата": "3 червня",
      "Заголовок": "Євген Омелянович Петрушевич",
      "Стаття": "Народився 3 червня 1863 року, український громадсько-політичний діяч, правник, доктор цивільного і церковного права (1891 р.), Президент Української Національної Ради та Уповноважений Диктатор (верховний військово-політичний зверхник під час війни) Західноукраїнської Народної Республіки (ЗУНР) (9 червня 1919 — 15 березня 1923), голова Української Національної Ради ЗУНР (1918—1919).",
      "Імя форми": "Видатний Лідер Західноукраїнської Народної Республіки",
      "Стаття форми": "Євген Омелянович Петрушевич, народжений 3 червня 1863 року, був визначним українським громадсько-політичним діячем і правником. Здобувши ступінь доктора цивільного і церковного права у 1891 році, Петрушевич активно включився в суспільно-політичне життя України. Його кар'єра досягла вершини під час формування Західноукраїнської Народної Республіки (ЗУНР), де він став Президентом Української Національної Ради. Його лідерство було особливо важливим у часи становлення ЗУНР, коли політична та військова ситуація вимагала сильних і рішучих дій.З 9 червня 1919 року по 15 березня 1923 року Євген Петрушевич виконував обов'язки Уповноваженого Диктатора ЗУНР, об'єднуючи під своїм керівництвом військово-політичні зусилля молодої держави. В цей період він виступав верховним військово-політичним зверхником, приймаючи ключові рішення для захисту і розбудови республіки. Його внесок у формування української державності та боротьбу за незалежність має велике історичне значення, що робить його постать видатною в історії України.",
      "Посилання": "Світ особистості. Євген Петрушевич - Президент Ради ЗУНР&http://surl.li/uhusx|Євген Петрушевич, президент Української Національної Ради ЗУНР&http://surl.li/uhusy|Євген Петрушевич. Світло і тіні українського Диктатора&http://surl.li/uhutd",
      "Фото": "Омелянович-Павленко_Михайло_big.png | Омелянович-Павленко_Михайло_small.png"
     },
     {
      "Місяць": "Червень",
      "Дата": "4 червня",
      "Заголовок": "Медвідь Михайло",
      "Стаття": "Народився 1913–1914, м. Тисмениця, Королівство Галичини та Володимирії, помер 4 червня 1945, с. Дев'ятники, Жидачівський район, Львівська область — діяч ОУН, один з організаторів та керівників УПА-Північ. Журналіст військових видань УПА. Використовував псевдоніми: Карпович, Кремінь, Микола Кре­­м’янецький, Микита, Чичкевич.",
      "Імя форми": "Організатор і Керівник УПА-Північ",
      "Стаття форми": "Михайло Медвідь народився в 1913–1914 роках у місті Тисмениця, що входило до складу Королівства Галичини та Володимирії. Його життєвий шлях був тісно пов'язаний з українським визвольним рухом, де він став визначним діячем Організації Українських Націоналістів (ОУН). Медвідь зіграв ключову роль в організації та керівництві Української Повстанської Армії (УПА) на північних теренах. Його лідерські якості та стратегічне мислення допомогли зміцнити позиції УПА у боротьбі за незалежність України.Крім своєї військової діяльності, Михайло Медвідь був активним журналістом військових видань УПА, використовуючи слово як потужну зброю у пропаганді національних ідей. Він загинув 4 червня 1945 року в селі Дев'ятники Жидачівського району Львівської області, залишивши по собі спадок незламного борця за свободу України. Його внесок у національно-визвольний рух залишається важливою сторінкою в історії України.",
      "Посилання": "Медвідь Михайло&http://surl.li/ugzrz|Енциклопедічна стаття - Медвідь Михайло Васильович&http://surl.li/uhutm",
      "Фото": "Медвідь_Михайло_big.png | Медвідь_Михайло_small.png"
     },
     {
      "Місяць": "Червень",
      "Дата": "5 червня",
      "Заголовок": "Микола Васильович Плав'юк",
      "Стаття": "Народився 5 червня 1925 року, український політичний і громадський діяч в еміграції, останній Президент УНР в екзилі (1989—1992), п'ятий Голова Організації українських націоналістів (1979—2012), визначний публіцист, співорганізатор та один з президентів СКВУ. Борець за незалежність України у ХХ сторіччі",
      "Імя форми": "Останній Президент УНР в Екзилі та Борець за Незалежність України",
      "Стаття форми": "Микола Васильович Плав'юк, народжений 5 червня 1925 року, був визначним українським політичним і громадським діячем в еміграції. Його діяльність охоплювала декілька десятиліть активної боротьби за незалежність України у ХХ сторіччі. У період з 1989 по 1992 рік він обіймав посаду останнього Президента Української Народної Республіки (УНР) в екзилі, де він активно працював над збереженням української державності та підтримкою національних інтересів на міжнародній арені. Його діяльність у цьому статусі була важливою для підтримки ідеї незалежності України під час радянської окупації.Крім того, Плав'юк був п'ятим Головою Організації українських націоналістів (1979—2012) і відігравав ключову роль у формуванні та керівництві українським національним рухом. Як визначний публіцист і співорганізатор Світового конгресу вільних українців (СКВУ), він сприяв об'єднанню української діаспори та поширенню українських національних ідей. Його внесок у боротьбу за незалежність України та розвиток української національної свідомості є невід'ємною частиною історії українського народу.",
      "Посилання": "Микола Плав'юк, останній Президент УНР в екзилі&http://surl.li/uhutu|Микола Плав’юк: Нація і Держава – назавжди!&http://surl.li/uhutv|Микола Плав’юк — останній президент УНР в екзилі  Культові українці&http://surl.li/uhutw",
      "Фото": "Плав'ю́к_Микола_big.png | Плав'ю́к_Микола_small.png"
     },
     {
      "Місяць": "Червень",
      "Дата": "14 червня",
      "Заголовок": "Євген Михайлович Коновалець",
      "Стаття": "Народився 14 червня 1891 року, український державний, військовий та політичний діяч, полковник Армії УНР, командир Січових Стрільців, член Стрілецької Ради, командант УВО, голова Проводу українських націоналістів (1927), засновник та перший голова ОУН (з 1929 по 1938), один із ідеологів українського націоналізму.",
      "Імя форми": "Засновник ОУН та Ідеолог Українського Націоналізму",
      "Стаття форми": "Євген Михайлович Коновалець, народжений 14 червня 1891 року, був видатним українським державним, військовим та політичним діячем. Він служив полковником Армії УНР і командиром Січових Стрільців, відіграючи важливу роль у боротьбі за незалежність України під час визвольних змагань. Як член Стрілецької Ради та командант Української Військової Організації (УВО), Коновалець втілював дух українського націоналізму і був ключовим стратегом у військовій і політичній сферах.У 1927 році Коновалець став головою Проводу українських націоналістів, а з 1929 по 1938 рік очолював Організацію українських націоналістів (ОУН), яку сам заснував. Як один із головних ідеологів українського націоналізму, він сформулював і просував ідеї національної самостійності та незалежності. Його діяльність і спадок мали величезний вплив на формування українського національного руху в XX столітті, роблячи його однією з найвизначніших постатей в історії України.",
      "Посилання": "Євген Коновалець  Біографія  Цікаві Факти&http://surl.li/uhuup|Євген Коновалець, полковник Армії УНР, голова ОУН&http://surl.li/uhuuq|Євген Коновалець – творець ОУН. 130 років від дня народження полковника&http://surl.li/uhuus",
      "Фото": "Коновалець_Євген_big.png | Коновалець_Євген_small.png"
     },
     {
      "Місяць": "Червень",
      "Дата": "16 червня",
      "Заголовок": "Іван Підкова",
      "Імя форми": "Іван Підкова: Легендарний Козак і Господар Молдови",
      "Стаття форми": "Іван Підкова, народжений у 1533 році на Брацлавщині або в Молдавському князівстві, був відомим очільником запорозького козацтва та господарем Молдови в період 1577–1578 років. Його життя було сповнене військових подвигів і боротьби за свободу, що зробило його легендарною постаттю в українській та молдовській історії. Підкова очолив запорозьких козаків і зумів стати правителем Молдови, де продовжив боротьбу за незалежність князівства від Османської імперії. За легендою, Іван Підкова був братом молдавського господаря Івони (Івана Води Лютого), який славився своєю боротьбою за незалежність Молдови і був убитий турками у 1574 році. Підкова, наслідуючи брата, прагнув звільнити Молдову від османського ярма, але його правління закінчилося у 1578 році, коли він був страчений у Львові. Іван Підкова залишив по собі спадок хоробрості та незламності, ставши символом боротьби за свободу і незалежність.",
      "Стаття": "Народився 1533, Брацлавщина або Молдавське князівство — 16 червня 1578, Львів) Відомий очільник запорозького козацтва, господар Молдови протягом 1577–1578 років. За легендою, нібито був братом молдавського господаря Івони (Івана Води Лютого), відомого своєю боротьбою за незалежність Молдовського князівства від Османської імперії та вбитого турками 1574 року.",
      "Посилання": "Іван Підкова - Українець, правитель Молдавії. Український гетьман запорізького козацтва&http://surl.li/uhuvb|Кошовий Отаман - Іван Підкова&http://surl.li/uhuvc|Іван Підкова: Я завжди діяв для добра та користі своєї Батьківщини&http://surl.li/uhuvd",
      "Фото": "Підкова_Іван_big.png | Підкова_Іван_small.png"
     },
     {
      "Місяць": "Червень",
      "Дата": "17 червня",
      "Заголовок": "Іван Брюховецький",
      "Стаття": "Народився 1623  — 17 червня 1668, Опішня — український військовий, політичний і державний діяч, дипломат. Гетьман Війська Запорозького, голова козацької держави на Лівобережній Україні (1663—1668).",
      "Імя форми": "Гетьман Лівобережної України та Видатний Дипломат",
      "Стаття форми": "Іван Брюховецький, народжений у 1623 році, був визначним українським військовим, політичним і державним діячем, а також талановитим дипломатом. У період з 1663 по 1668 рік він обіймав посаду гетьмана Війська Запорозького, очолюючи козацьку державу на Лівобережній Україні. Брюховецький прийшов до влади в часи великої політичної нестабільності, відомої як Руїна, коли внутрішні конфлікти і зовнішні загрози вимагали рішучих дій і стратегічного мислення.Під його керівництвом Лівобережна Україна переживала складні переговори з Москвою та сусідніми державами, намагаючись зберегти автономію та козацькі вольності. Брюховецький активно укладав угоди та шукав підтримки для зміцнення своєї влади і держави. Його правління завершилося трагічно 17 червня 1668 року в Опішні, але його внесок у дипломатію і військове мистецтво залишив значний слід в історії України.",
      "Посилання": "Проєкт \"Гетьманщина\". Іван Брюховецький – зрадник чи герой?&http://surl.li/uhuvp|Іван Брюховецький – перший попихач москви // «Ген українців» з Іриною Фаріон&http://surl.li/uhuvt|Гетьман Брюховецький: від служби Москві до повстання проти російського царя&http://surl.li/uhuvw",
      "Фото": "Брюхове́цький_Іван_big.png | Брюхове́цький_Іван_small.png"
     },
     {
      "Місяць": "Червень",
      "Дата": "20 червня",
      "Заголовок": "Петро Іванович Калнишевський",
      "Стаття": "Святий праведний Петро Калнишевський народився 20 червня 1690/1691), с. Пустовійтівка, Костянтинівська сотня, Лубенський полк, Військо Запорозьке Городове — 31 жовтня 1803, Спасівський ставропігійний монастир на Соловецьких островах, Російська імперія — визначний український державний, культурний та релігійний діяч, кошовий отаман Війська Запорозького Низового (1762, 1765—1775). Кавалер Ордена Андрія Первозванного. Політичний в'язень Російської імперії.",
      "Імя форми": "Видатний Кошовий Отаман і Політичний В'язень",
      "Стаття форми": "Святий праведний Петро Калнишевський, народжений 20 червня 1690/1691 року в селі Пустовійтівка, був видатним українським державним, культурним та релігійним діячем. Він обіймав посаду кошового отамана Війська Запорозького Низового у 1762 році та знову з 1765 по 1775 роки. За свою діяльність отримав Орден Андрія Первозванного, що свідчить про його важливу роль у тодішньому суспільстві. Калнишевський активно сприяв розвитку Запорозької Січі, підтримував культурні та релігійні ініціативи, зокрема сприяв будівництву церков і монастирів, що зміцнювало духовне життя українців.Однак його діяльність не завжди була прийнятною для влади Російської імперії. У 1775 році, після знищення Запорозької Січі, Калнишевського арештували та відправили до Спасівського ставропігійного монастиря на Соловецьких островах, де він провів решту свого життя як політичний в'язень. Помер 31 жовтня 1803 року, залишивши по собі спадок незламного борця за українські права та духовні цінності. Його канонізація свідчить про значення його життя і діянь для українського народу.",
      "Посилання": "Петро Калнишевський - останній кошовий Запорізької Січі&http://surl.li/uhuwp",
      "Фото": "Калнишевський_Петро_big.png | Калнишевський_Петро_small.png"
     },
     {
      "Місяць": "Червень",
      "Дата": "30 червня",
      "Заголовок": "Роман Шухевич",
      "Стаття": "Народився 30 червня 1907 -  український політичний, громадський, державний і військовий діяч. Член галицького крайового проводу Організації українських націоналістів. Активний діяч ОУН. Один з організаторів замаху на Станіслава Собінського та Еміліяна Чеховського. Учасник боїв на Красному полі на стороні Карпатської Січі. Командир з боку українців українського військового підрозділу «Нахтігаль» у складі іноземних легіонів Вермахту (1941–1942). Генерал-хорунжий, головнокомандувач Української повстанської армії (1943—1950), голова Секретаріату Української головної визвольної ради (1943–1950). Борець за незалежність України у XX сторіччі.",
      "Імя форми": "Генерал-хорунжий та Борець за Незалежність України",
      "Стаття форми": "Роман Шухевич, народжений 30 червня 1907 року, був видатним українським політичним, громадським, державним і військовим діячем. Як активний член Організації українських націоналістів (ОУН), він відіграв ключову роль у боротьбі за українську незалежність. Шухевич був одним з організаторів замаху на польських діячів Станіслава Собінського та Еміліяна Чеховського, демонструючи свою відданість справі українського національного визволення. Також він брав участь у боях на Красному полі на боці Карпатської Січі, показуючи свою готовність до збройної боротьби.У 1941–1942 роках Шухевич командував українським військовим підрозділом «Нахтігаль» у складі іноземних легіонів Вермахту, а з 1943 по 1950 роки очолював Українську повстанську армію (УПА) як головнокомандувач, отримавши звання генерала-хорунжого. Він також був головою Секретаріату Української головної визвольної ради, координуючи діяльність повстанських сил та політичного руху. Шухевич став символом боротьби за незалежність України у ХХ сторіччі, залишивши глибокий слід в історії українського національного руху та здобувши визнання як один з найважливіших борців за свободу України.",
      "Посилання": "Роман Шухевич: руйнуємо радянсько-російські міфи про головного командира УПА // 10 запитань історику&http://surl.li/uhuxn|Головнокомандувач УПА Роман Шухевич&http://surl.li/uhuxo|Роман Шухевич&http://surl.li/uhuxs",
      "Фото": "Шухевич_Роман_big.png |Шухевич_Роман_small.png"
     },
     {
      "Місяць": "Липень",
      "Дата": "3 липня",
      "Заголовок": "Іван Скоропадський",
      "Імя форми": "Гетьман Лівобережної України та Видатний Козацький Лідер",
      "Стаття форми": "Іван Скоропадський, народжений у 1646 році, був видатним українським військовим, політичним і державним діячем, який обіймав посаду гетьмана Війська Запорозького та голови козацької держави в Лівобережній Україні з 1708 по 1722 роки. Представник козацького роду Скоропадських, він був старшим сином Іллі Скоропадського. Його кар'єра включала службу як генерального бунчужного (1698-1699), генерального осавула (1701-1706), і стародубського полковника (1706-1708). Скоропадський став гетьманом у період складних політичних змін, відомих як Глухівський період, коли Україна переживала значні внутрішні та зовнішні виклики.\nЯк гетьман, Скоропадський працював над зміцненням козацької автономії та підтриманням стабільності на Лівобережній Україні. Він здійснював активну дипломатичну діяльність, намагаючись зберегти баланс між впливом Московського царства і внутрішніми потребами козацької держави. Скоропадський підтримував розвиток культури і освіти, сприяв будівництву церков і монастирів, зміцнюючи таким чином духовне життя українського народу. Його правління завершилося 3 липня 1722 року, але його спадок як одного з визначних лідерів козацької України залишився значущим в історії країни.",
      "Стаття": "Народився 1646 по 3 липня 1722 — український військовий, політичний і державний діяч, гетьман Війська Запорозького, голова козацької держави в Лівобережній Україні (1708-1722). Представник козацького роду Скоропадських. Старший син Іллі Скоропадського. Генеральний бунчужний (1698-1699), генеральний осавул (1701-1706), стародубський полковник (1706-1708). Гетьман Глухівського періоду в історії України.",
      "Посилання": "Павло Скоропадський  Біографія  Цікаві факти&http://surl.li/uhuyf|Іван Скоропадський (1646—1722) — гетьман Лівобережної України у 1708—1722 рр.&http://surl.li/uhuyj",
      "Фото": "Скоропа́дський_Іван_big.png | Скоропа́дський_Іван_small.png"
     },
     {
      "Місяць": "Липень",
      "Дата": "7 липня",
      "Заголовок": "Вітовський Дмитро Дмитрович",
      "Стаття": "Народився 7 липня 1919 року - помер 29 квітня 1946 року - український політичний і військовий діяч. Член ОУН й ПУН. Після смерті Голови ПУН полковника А.Мельника, очолив ПУН й ОУН тим самим став третім Головою ПУН й ОУН.",
      "Імя форми": "Непохитний Лідер ОУН та ПУН",
      "Стаття форми": "Дмитро Дмитрович Вітовський народився 7 липня 1919 року та пішов з життя 29 квітня 1946 року. Він відомий як видатний український політичний і військовий діяч, який активно брав участь у діяльності Організації українських націоналістів (ОУН) і Повстанського угруповання націоналістів (ПУН). Після смерті полковника Андрія Мельника, Вітовський очолив ПУН та ОУН, ставши третім Головою обох організацій. Його лідерство було важливим у складний час національно-визвольної боротьби.Під керівництвом Вітовського ОУН та ПУН продовжили свою боротьбу за незалежність України. Він демонстрував велику відданість і відвагу, стоячи на чолі організацій у найважчі періоди їх історії. Хоча його життя завершилося рано, його внесок у боротьбу за вільну Україну залишився невмирущим, а його ім'я є символом вірності і героїзму серед українського народу.",
      "Посилання": "Дмитро Вітовський, сотник Легіону Українських січових стрільців&http://surl.li/uhuyu|Дмитро Вітовський – герой, який захопив Львів Велич Особистості&http://surl.li/uhuyz|Вітовський Дмитро, полковник УГА, творець Листопадового Чину&https://100krokiv.info/2017/11/vitovskyj-dmytro/",
      "Фото": "Вітовський_Дмитро_big.png |Вітовський_Дмитро_small.png"
     },
     {
      "Місяць": "Липень",
      "Дата": "8 липня",
      "Заголовок": "Олекса Гасин",
      "Стаття": "Народився 8 липня 1907 - помер 31 січня 1949 року. Український політичний і військовий діяч, учасник визвольних змагань 1940-х років, заступник військового міністра в Українському державному правлінні (07.1941), керівник групи УПА-Захід (на початку 1944), начальник Головного військового штабу УПА (01.1946 — 01.1949). Полковник УПА.",
      "Імя форми": "Герой УПА та Відданий Борець за Вільну Україну",
      "Стаття форми": "Олекса Гасин народився 8 липня 1907 року і віддав своє життя боротьбі за вільну Україну, померши 31 січня 1949 року. Він був видатним українським політичним і військовим діячем, який активно діяв у визвольних змаганнях 1940-х років. Гасин обіймав важливі посади у військовій структурі Українського державного правління, виступав як заступник військового міністра влітку 1941 року.У роки нацистської окупації та післявоєнного періоду він був керівником групи УПА-Захід та очолював Головний військовий штаб Української Повстанської Армії (УПА) з січня 1946 по січень 1949 року. Його відданість і мужність в боротьбі проти радянської окупації зробили його справжнім символом української національної долі. Олекса Гасин залишив невимовний слід у історії України як вірний патріот і непохитний захисник національних інтересів.",
      "Посилання": "Олекса Гасин: Лицар УПА, найближчий побратим і порадник Романа Шухевича&http://surl.li/uhuzs|«Лицар» УПА&http://surl.li/uhuzu|Історія Пласту - Гасин Олекса, полковник УПА&http://surl.li/uhuzw",
      "Фото": "Гасин_Олекса_big.png | Гасин_Олекса_small.png"
     },
     {
      "Місяць": "Липень",
      "Дата": "14 липня",
      "Заголовок": "Олег Данилович Штуль",
      "Стаття": "Народився 14 липня 1917 року, с. Лопатичі, Овруцький повіт, Волинська губернія — 4 листопада 1977 року, м. Торонто, Канада) Український політичний і військовий діяч. Член ОУН й ПУН. Після смерті Голови ПУН полковника А.Мельника, очолив ПУН й ОУН тим самим став третім Головою ПУН й ОУН.",
      "Імя форми": "Символ Вірності та Стриманості Українського Національного Руху",
      "Стаття форми": "Олег Данилович Штуль, народився 14 липня 1917 року у селі Лопатичі, Волинська губернія, був видатним українським політичним і військовим діячем. Як член Організації українських націоналістів (ОУН) і Повстанського угруповання націоналістів (ПУН), він віддавав своє життя боротьбі за вільну Україну. Після смерті полковника Андрія Мельника, Штуль очолив ПУН та ОУН, ставши третім Головою обох організацій. Його лідерство було важливим у складний час національно-визвольної боротьби.Під керівництвом Штуля ОУН та ПУН продовжили свою боротьбу за незалежність України. Він відзначався своєю відданістю принципам і ідеалам українського національного руху, а також стриманістю та розсудливістю у важливих рішеннях. Навіть після еміграції до Канади, Штуль продовжував підтримувати ідеї незалежності України та впливати на українську діаспору. Його життєва та політична діяльність залишили великий слід у історії українського національного руху.",
      "Посилання": "Олег Штуль-Жданович та його роль у похідних групах ОУН під час Другої Світової війни&http://surl.li/uhvam|Олег Штуль-Жданович – вірний син українського народу&http://surl.li/uhvan|Штуль Олег Данилович (Штуль-Жданович)&http://surl.li/uhvap",
      "Фото": "Штуль_Олег_big.png |Штуль_Олег_small.png"
     },
     {
      "Місяць": "Липень",
      "Дата": "28 липня",
      "Заголовок": "Володимир Кирилович Винниченко",
      "Стаття": "Народився 28 липня 1880 року - український політичний і громадський діяч, прозаїк, драматург і художник. Автор усіх делегацій, універсалів та законодавчих проєктів УНР. Перший голова Директорії УНР (14 грудня 1918 року — 10 лютого 1919 року), голова Генерального секретаріату та генеральний секретар внутрішніх справ. Другий очільник Українського Національного Союзу, з 18 вересня 1918 по 14 листопада 1918. Представник делегації Української Центральної Ради у Петрограді.",
      "Імя форми": "Архітектор Української Державності та Літературного Відродження",
      "Стаття форми": "Володимир Кирилович Винниченко, народився 28 липня 1880 року, відомий як видатний український політичний і громадський діяч, прозаїк, драматург і художник. Він був майстром слова та мислителем, чиї ідеї визначили подальший розвиток української державності. Винниченко став першим головою Директорії Української Народної Республіки (УНР) з 14 грудня 1918 по 10 лютого 1919 року, де його рішучість і віра в незалежність України були визнані в усьому світі.Він також відомий як голова Генерального секретаріату та генеральний секретар внутрішніх справ УНР, а також як другий очільник Українського Національного Союзу. Його внесок у розробку делегацій, універсалів та законодавчих проєктів УНР був важливим для консолідації українського народу та забезпечення його прав. Паралельно з політичною діяльністю, Володимир Винниченко активно розвивав українську літературу та мистецтво, ставлячи перед собою мету прославлення української культури на всіх рівнях.",
      "Посилання": "Володимир Винниченко  Біографія  Цікаві факти&http://surl.li/uhvaz|Володимир Винниченко, перший голова уряду УНР, письменник&http://surl.li/uhvba|УкрЛіб - Винниченко Володимир Кирилович&http://surl.li/uhvbb",
      "Фото": "Винниченко_Володимир_big.png | Винниченко_Володимир_small.png"
     },
     {
      "Місяць": "Серпень",
      "Дата": "1 серпня",
      "Заголовок": "Грабець Омелян Петрович",
      "Стаття": "Народився  1 серпня 1911, с. Нове Село, Холмщина — 10 червня 1944, с. Микулинці, Літинський район, Вінницька область. Український військовик, діяч «Пласту», ОУН. Полковник УПА, член Головного військового штабу ОУН, учасник похідних груп ОУН 1941 року, обласний провідник ОУН Рівненщини (1941—1942), Кам'янець-Подільщини (1942—1943), провідник Центральної округи ОУН на східноукраїнських землях (СУЗ) (1943—1944), організатор та командир ВО «Вінниця» групи УПА-Південь у Вінницькій та Хмельницькій областях (літо 1943 — 10.06.1944).",
      "Імя форми": "Воїн та Видатний Діяч УПА",
      "Стаття форми": 'Омелян Петрович Грабець, народився 1 серпня 1911 року в селі Нове Село, Холмщина, відомий як відважний український військовик та видатний діяч "Пласту" і Організації Українських Націоналістів (ОУН). Він прославився як полковник Української Повстанської Армії (УПА), член Головного військового штабу ОУН і організатор численних операцій проти окупаційних сил.Грабець активно брав участь у різних військових діяннях, включаючи участь у похідних групах ОУН у 1941 році та керівництво групою УПА-Південь у Вінницькій та Хмельницькій областях. Його лідерство та мужність стали невід\'ємною частиною історії УПА та боротьби за незалежність українського народу. Незважаючи на свою ранню смерть 10 червня 1944 року в селі Микулинці, Літинський район, його внесок у українську боротьбу за волю та незалежність завжди буде пам\'ятатися і шануватися.',
      "Посилання": "\"Покоління. Паралелі\". Сучасні добровольці. Омелян Грабець \"Батько\". УПА на Вінниччині&http://surl.li/uhven|10 червня 1944 року у бою з московитами загинув Омелян Грабець «Батько» полковник УПА&http://surl.li/uhveo|Полковник Омелян Грабець «Батько» – командира УПА-Південь (автор: Бородач Василь)&http://surl.li/uhame",
      "Фото": "Грабець_Омелян_big.png |Грабець_Омелян_small.png"
     },
     {
      "Місяць": "Серпень",
      "Дата": "7 серпня",
      "Заголовок": "Григорій Мацейко",
      "Стаття": "Народився 7 серпня 1913 року, смт Щирець, Львівський район, Львівська область — помер 11 серпня 1966 року, м. Ланус, Аргентина. Григорій був членом Організації українських націоналістів, виконавець замаху на міністра внутрішніх справ Польщі Броніслава Перацького.",
      "Імя форми": "Борець за Незалежність та Свободу України",
      "Стаття форми": "Григорій Мацейко народився 7 серпня 1913 року у смт Щирець, Львівська область, і став одним із видатних членів Організації Українських Націоналістів. Його життєва дорога змусила його боротися за свободу та незалежність українського народу. Він став виконавцем замаху на міністра внутрішніх справ Польщі Броніслава Перацького, що свідчить про його відданість і рішучість у боротьбі проти режиму, який пригнічував український народ.Попри складнощі та небезпеку, Григорій Мацейко залишався вірним своїм ідеалам і продовжував боротьбу за свободу аж до своєї смерті 11 серпня 1966 року в місті Ланус, Аргентина. Його внесок у боротьбу за незалежність України завжди буде пам'ятатися і вшановуватися як важлива частина історії національного визволення.",
      "Посилання": "Загадковий атентатник в історії ОУН&http://surl.li/uhvfc|Григорій Мацейко-“Ґонта”, виконавець замаху на міністра внутрішніх справ Польщі Броніслава Пєрацького (110 років тому)&http://surl.li/uhvfi",
      "Фото": "Мацейко_Григорій_big.png | Мацейко_Григорій_small.png"
     },
     {
      "Місяць": "Серпень",
      "Дата": "10 серпня",
      "Заголовок": "Олександр Григорович Бусел",
      "Стаття": "Народився 10 серпня 1910 року, Кальварія (біля Вільнюса), Литва — 9 березня 1943 року, Рівне. Діяч ОУН, окружний провідник ОУН Рівненщини (1933—1935).",
      "Імя форми": "Герой Боротьби за Волю та Незалежність",
      "Стаття форми": "Олександр Григорович Бусел, народився 10 серпня 1910 року в Кальварії, Литва, був видатним діячем Організації Українських Націоналістів (ОУН) і окружним провідником на Рівненщині у період з 1933 по 1935 роки. Він віддавав своє життя боротьбі за вільну і незалежну Україну.Бусел відзначався великим патріотизмом і вірою в ідеали національної свободи. Його активна діяльність у складний період історії України слугувала прикладом для багатьох і стала символом непохитної відданості і рішучості. Незважаючи на трагічне завершення свого життя 9 березня 1943 року в Рівному, його спадщина і внесок у боротьбу за волю українського народу завжди будуть пам'ятатися та вшановуватися.",
      "Посилання": "БРАТИ БУСЛИ. ЖИТТЯ ЗА УКРАЇНУ&http://surl.li/uhvfw|Бусел Олександр Григорович&http://surl.li/uhvfz",
      "Фото": "Бусел_Олександр_big.png | Бусел_Олександр_small.png"
     },
     {
      "Місяць": "Серпень",
      "Дата": "11 серпня",
      "Заголовок": "Іван Сірко",
      "Стаття": "Народився 1605 (1610) — помер 11 серпня 1680 року. Український полководець, подільський шляхтич, козацький ватажок, кальницький полковник, кошовий отаман Запорозької Січі й усього Війська Запорозького Низового. Здобув перемогу в 65 боях. Герой багатьох українських пісень і казок.",
      "Імя форми": "Легендарний Ватажок та Герой Битв",
      "Стаття форми": "Іван Сірко, народився близько 1605 або 1610 року, а його життя завершилось 11 серпня 1680 року. Він був видатним українським полководцем, ватажком та кальницьким полковником, який прославився як кошовий отаман Запорозької Січі та усього Війська Запорозького Низового. Сірко відзначався неабиятою мужністю та відданістю і здобув перемогу у 65 битвах, ставши символом героїзму та сили українського козацтва.Він ввійшов до народної пам'яті як герой численних українських пісень і казок, які відтворюють його подвиги та велич козацької доби. Іван Сірко залишився в історії як символ національного героїзму та непохитної віри в волю та незалежність українського народу.",
      "Посилання": "Іван Сірко: бойовий чаклун 99 рівня&http://surl.li/uhvgt|Суспільне зібрало 10 цікавих фактів про Івана Сірка&http://surl.li/uhvhi",
      "Фото": "Сірко_Іван_big.png |Сірко_Іван_small.png"
     },
     {
        "Місяць": "Вересень",
        "Дата": "18 вересня",
        "Заголовок": "Яким Сомко",
        "Стаття": "Народився в 1610 - тих роках — помер 18 вересня 1663, Борзна. Державний діяч Гетьманщини XVII століття, полководець, дипломат, один з найвідоміших представників городової старшини Переяславщини. Гетьман Війська Запорозького на Лівобережжі. У сучасній історичній науці вважається провідником елітарної аристократії (козацької старшини), прихильником сильної влади суверена (гетьмана) й автономного васалітету у відносинах Війська Запорозького з Московським царством.",
        "Імя форми": "Гетьман і Державний Діяч XVII століття",
        "Стаття форми": "Яким Сомко народився приблизно у 1610-х роках і пішов з життя 18 вересня 1663 року в місті Борзна. Він відомий як видатний державний діяч Гетьманщини XVII століття, полководець та дипломат, що відіграв значну роль у політичному житті того часу.Сомко відомий також як гетьман Війська Запорозького на Лівобережжі. Його роль в історії України була визначною, оскільки він був представником городової старшини Переяславщини і відстоював інтереси української аристократії. У сучасній історичній науці Яким Сомко вважається провідником елітарної аристократії та прихильником сильної влади гетьмана та автономії у відносинах Війська Запорозького з Московським царством. Його внесок у формування політичного ландшафту та самоідентифікацію України надовго залишиться в історичних дослідженнях.",
        "Посилання": "Яким Сомко. Про гетьманів та кошових отаманів України ч.11.&http://surl.li/uhvil|ЯКИМ СОМКО, ПОЛКОВНИК ПЕРЕЯСЛАВСЬКИЙ, НАКАЗНИЙ ГЕТЬМАН ЛІВОБЕРЕЖНОЇ УКРАЇНИ.&http://surl.li/uhvin|ЯКИМ СОМКО (1619–1663 )&http://surl.li/uhviq",
        "Фото": "Сомко_Яким_big.png | Сомко_Яким_small.png"
       },
       {
        "Місяць": "Вересень",
        "Дата": "23 вересня",
        "Заголовок": "Володимир Михайлович Кубійович",
        "Стаття": "Народився 23 вересня 1900 року, Новий Санч, Королівство Галичини та Володимирії, Австро-Угорщина (нині Польща) — 2 листопада 1985 року, Париж, Франція. Український географ, енциклопедист, видавець, громадсько-політичний діяч. Очільник Українського центрального комітету (УЦК), з метою відстоювання інтересів українців співпрацював з нацистською Німечиною. Організатор видання та головний редактор Енциклопедії українознавства та фундаментальної праці «Ґеоґрафія українських і сумежних земель.",
        "Імя форми": "Володимир Кубійович: Співпраця та Діяльність у Галузі Науки та Політики",
        "Стаття форми": 'Володимир Михайлович Кубійович, народився 23 вересня 1900 року у Новому Санчі, що колись належало до Королівства Галичини та Володимирії в складі Австро-Угорщини (тепер у Польщі), а помер 2 листопада 1985 року у Парижі, Франція. Він відомий як український географ, енциклопедист, видавець та громадсько-політичний діяч.Кубійович очолював Український центральний комітет (УЦК), співпрацюючи з нацистською Німеччиною для відстоювання інтересів українців. Однак його внесок у галузь науки і політики також важливий. Він був організатором видання та головним редактором таких видань, як "Енциклопедія українознавства" та фундаментальної праці "Ґеоґрафія українських і сумежних земель". Його наукові та видавничі зусилля мали велике значення для розвитку української науки та культури.',
        "Посилання": "Володимир Кубійович – ініціатор створення дивізії СС \"Галичина\"&http://surl.li/uhvjj|Володимир Кубійович&http://litopys.org.ua/encycl/eui002.htm",
        "Фото": "Кубійо́вич_Володимир_big.png | Кубійо́вич_Володимир _small.png"
       },
       {
        "Місяць": "Вересень",
        "Дата": "24 вересня",
        "Заголовок": "Микола Іванович Кулик",
        "Стаття": "Народився 24 вересня 1927 року, с. Німстів, тепер Любачівський повіт, Підкарпатське воєводство — 17 жовтня 2013 року, Канада. Вояк УПА, відомий громадський діяч української діаспори в Канаді, член адміністрації видавничого комітету «Літопису УПА», активний член Об'єднання колишніх вояків УПА в США та Канаді.",
        "Імя форми": "Вояк УПА та Громадський Діяч",
        "Стаття форми": 'Микола Іванович Кулик народився 24 вересня 1927 року в селі Німстів, що на території нинішнього Любачівського повіту в Підкарпатському воєводстві. Його життя і діяльність були пов\'язані з боротьбою за незалежність України. Він був вояком Української Повстанської Армії (УПА), що відіграв значну роль у захисті української національної ідеї.Після переїзду до Канади Микола Іванович став відомим громадським діячем української діаспори. Він був членом адміністрації видавничого комітету "Літопису УПА" та активним учасником Об\'єднання колишніх вояків УПА в США та Канаді. Його внесок у вивчення і популяризацію історії УПА та боротьби за вільну Україну залишається невимірним, а його спадок продовжує жити в серцях української громадськості по всьому світу.',
        "Посилання": "Кулик Микола Іванович&https://esu.com.ua/article-51267|Кулик Микола Іванович Матеріал з Вікіпедії&http://surl.li/uhvjt",
        "Фото": "Кулик_Микола_big.png |Кулик_Микола_small.png"
       },
       {
        "Місяць": "Вересень",
        "Дата": "29 вересня",
        "Заголовок": "Михайло Сергійович Грушевський",
        "Стаття": "Народився 29 вересня 1866, Холм, Холмський повіт, Люблінська губернія, Королівство Польське, Російська імперія — 26 листопада 1934, 24 листопада 1934 або 25 листопада 1934, Кисловодськ, Північно-Кавказький край, РСФРР, СРСР. Український історик, громадський та політичний діяч. Голова Центральної Ради Української Народної Республіки (1917—1918). Член Історичного товариства ім. Нестора-Літописця, член Чеської АН (1914), почесний член Київського товариства старожитностей і мистецтв (1917), академік ВУАН (1923) та АН СРСР (1929), багаторічний голова Наукового Товариства ім. Шевченка у Львові (1897—1913), завідувач кафедри історії Львівського університету (1894—1914), автор понад 2000 наукових праць.",
        "Імя форми": "Український Історик та Політичний Діяч",
        "Стаття форми": "Михайло Сергійович Грушевський народився 29 вересня 1866 року у місті Холм, що тоді входило до Холмського повіту Люблінської губернії Російської імперії (нині на території Польщі). Його ім'я стало синонімом української історіографії та політичної діяльності.Грушевський був головою Центральної Ради Української Народної Республіки в період 1917—1918 років. Він також був активним учасником історичних досліджень, єдиним членом Історичного товариства ім. Нестора-Літописця та академіком ВУАН та АН СРСР. Завдяки своїй надзвичайній працьовитості він створив понад 2000 наукових праць, які досліджували історію та культуру українського народу. Його спадок в українській історії та національній свідомості є невимовним, а його праці залишаються джерелом натхнення для наступних поколінь українців.",
        "Посилання": "Михайло Грушевський: політик, історик, сім‘янин&http://surl.li/uhvka|ГРУШЕВСЬКИЙ Михайло Сергійович (1866-1934)&https://knu.ua/ua/geninf/osobystosti/grushevskiy",
        "Фото": "Груше́вський_Михайло_big.png |Груше́вський_Михайло_small.png"
       },
       {
        "Місяць": "Жовтень",
        "Дата": "2 жовтня",
        "Заголовок": "Габовда Михайло",
        "Стаття": "Псевдоніми: «Іскра», «Лозан». Народився 2 жовтня 1918 року, США — 8 грудня 1945 року, Ужгород, Закарпатська Україна. Референт зв'язку крайового Проводу ОУН «Закарпаття» (1944—1945).",
        "Імя форми": "Відданий Референт Зв'язку ОУН на Закарпатті",
        "Стаття форми": 'Михайло Габовда, відомий під псевдонімами "Іскра" та "Лозан", народився 2 жовтня 1918 року у США. Його життя та діяльність були нерозривно пов\'язані з боротьбою за незалежність української нації.У період 1944—1945 років, Михайло Габовда обіймав посаду референта зв\'язку крайового Проводу Організації Українських Націоналістів на Закарпатті. Його внесок полягав у підтримці комунікацій між різними підрозділами та лідерами ОУН на цій території, що було важливим аспектом для успішного функціонування організації. Його відданість справі української незалежності та мужність у боротьбі за ціль призвела до того, що він пожертвував своїм життям у цій боротьбі, померши 8 грудня 1945 року у місті Ужгороді, Закарпатська Україна. Його внесок і пам\'ять живуть у серцях українського народу, який пам\'ятає його як справжнього патріота.',
        "Посилання": "Габовда Михайло, провідник Пласту у Великих Лучках&http://surl.li/uhvkr|Габовда Михайло Дмитрович&https://esu.com.ua/article-27916",
        "Фото": "Габовда_Михайло_big.png | Габовда_Михайло_small.png"
       },
       {
        "Місяць": "Жовтень",
        "Дата": "16 жовтня",
        "Імя форми": "Символ Відданості та Сміливості в Боротьбі за Волю України",
        "Стаття форми": "Олександр Андрійович Луцький, відомий також під численними псевдонімами, серед яких \"Довбня\", \"Богун\", \"Марко\", \"Беркут\", \"Богдан\", \"Андрієнко\", \"Клименко\", \"Боднар\", народився 6 жовтня 1910 року у селі Боднарів, що тепер належить до Калуського району Івано-Франківської області. Він був відомим діячем Організації Українських Націоналістів та одним з організаторів Української Народної Самооборони та УПА-Захід. У різний час він очолював різні підрозділи УПА, був командиром УНС, УПА-Захід та УПА-Захід-Карпати, віддавши свою енергію та мужність заради боротьби за вільну Україну. Його життя та діяльність є світлим прикладом відданості та сміливості в боротьбі за національну незалежність. Він помер 13 листопада 1946 року у Києві, але його спадок і пам'ять живуть у серцях українців як символ відданості та героїзму.",
        "Заголовок": "Олександр Андрійович Луцький",
        "Стаття": "Псевдонім: «Довбня», «Богун», «Марко», «Беркут», «Богдан», «Андрієнко», «Клименко», «Боднар». Народився 6 жовтня 1910 року, с. Боднарів, тепер Калуський район, Івано-Франківська область — 13 листопада 1946 року, Київ. Діяч ОУН, один з організаторів Української Народної Самооборони та УПА-Захід, командир УНС (07.1943 — 11.1943), УПА-Захід (11.1943 — 26.01.1944), УПА-Захід-Карпати (08.1944 — 09.1944).",
        "Посилання": "Діяч ОУН, один з організаторів Української Народної Самооборони Луцький Олександр Андрійович&http://surl.li/uhvkt|ЛУ́ЦЬКИЙ Олександр Андрійович&https://esu.com.ua/article-59464",
        "Фото": "Луцький_Олександр_big.png | Луцький_Олександр_small.png"
       },
       {
        "Місяць": "Жовтень",
        "Дата": "17 жовтня",
        "Заголовок": "Болбочан Петро Федорович",
        "Стаття": "Народився 17 жовтня 1883, с. Геджев, Хотинський повіт, Бессарабська губернія, Російська імперія — 28 червня 1919, с. Балин, Подільська губернія, УНР). Український військовий діяч, полковник Армії УНР, очільник Кримської операції проти більшовиків з метою встановлення на території півострова української влади та взяття під контроль Чорноморського флоту. Учасник радянсько-української війни, антигетьманського повстання. З листопада 1918 року по січень 1919 року Болбочан керував Обороною північно-східної України.",
        "Імя форми": "Символ Незламності та Відданості у Боротьбі за Волю України",
        "Стаття форми": "Петро Федорович Болбочан народився 17 жовтня 1883 року у селі Геджев, Хотинського повіту, що належало до Бессарабської губернії Російської імперії. Він став символом незламності та відданості українській справі у найважчі часи.Петро Болбочан був українським військовим діячем, полковником Армії УНР. Він очолював Кримську операцію проти більшовиків, маючи за мету встановлення української влади на півострові та взяття під контроль Чорноморського флоту. Болбочан також брав участь у радянсько-українській війні та антигетьманському повстанні. З листопада 1918 року по січень 1919 року він керував Обороною північно-східної України, демонструючи свою відвагу та вміння в складних бойових умовах. Його життя та боротьба служать прикладом непохитної віри українського народу у свою волю та незалежність. Він помер 28 червня 1919 року в селі Балин, Подільській губернії, залишивши свій слід у історії боротьби за вільну Україну.",
        "Посилання": "Легенда українського війська: полковник Петро Болбочан&http://surl.li/uhvla|Полковник армії УНР Петро Болбочан: жертва інтриг чи претендент у диктатори?&http://surl.li/uhvlb|Петро Болбочан. Як українці Сімферополь звільняли&http://surl.li/uhvle",
        "Фото": "Болбочан_Петро_big.png | Болбочан_Петро_small.png"
       },
       {
        "Місяць": "Жовтень",
        "Дата": "18 жовтня",
        "Заголовок": "Єфремов Сергій Олександрович",
        "Стаття": "Народився 18 жовтня 1876 року, Пальчик, Звенигордський повіт, Київська губернія, Російська імперія, тепер Катеринопільського району Черкаської області — 31 березня 1939 року, Володимирська в'язниця ГУГБ, Владимир, Російська РФСР, СРСР. Український громадсько-політичний і державний діяч, літературний критик, історик літератури, академік Української академії наук (з 1919), віце-президент ВУАН (з 1922), дійсний член Наукового товариства імені Тараса Шевченка у Львові, публіцист, один із творців української журналістики.",
        "Імя форми": "Зодіяння та Дороговказ для Української Культурної Сцени",
        "Стаття форми": "Сергій Олександрович Єфремов, народився 18 жовтня 1876 року у селі Пальчик, Київська губернія, відіграв надзвичайно важливу роль у розвитку української культурної сцени та громадсько-політичному житті.Будучи академіком Української академії наук та віце-президентом ВУАН, Єфремов вніс значний внесок у розвиток української науки та літератури. Він також був активним членом Наукового товариства імені Тараса Шевченка у Львові та одним з творців української журналістики. Своїми публікаціями та діяльністю він збагатив культурний ландшафт України та став важливим дороговказом для наступних поколінь українських інтелектуалів. Сергій Єфремов помер 31 березня 1939 року у Володимирській в'язниці ГУГБ, залишивши поза собою непереможне спадщину, яка додосі вдихає нове життя в українську культурну та наукову сцену.",
        "Посилання": "Ірина Фаріон про Сергія Єфремова – символа національного відродження&http://surl.li/uhvlm|Календар історії та культури&http://surl.li/uhvln|Сергій Олександрович Єфремов&https://zbruc.eu/node/58149",
        "Фото": "Єфремов_Сергій_big.png |Єфремов_Сергій_small.png"
       },
       {
        "Місяць": "Жовтень",
        "Дата": "21 жовтня",
        "Заголовок": "Пилип Орлик",
        "Стаття": "Народився 21 жовтня 1672 року, Косута — 24 травня 1742 року, Ясси. Український політичний, державний і військовий діяч, Генеральний писар (1702–1709), гетьман Війська Запорозького у вигнанні (1710–1742), поет, публіцист. Представник шляхетського роду Орликів (чеського походження), які користалися гербом «Новина». Один з упорядників «Договорів і постанов» — конституційного акту, який є першою українською Конституцією, фактично — козацьким суспільним договором.",
        "Імя форми": "Козацький Вождь та Архітектор Української Конституції",
        "Стаття форми": 'Пилип Орлик, народився 21 жовтня 1672 року в селі Косута, відомий як видатний український політичний, державний і військовий діяч, а також визнаний поет та публіцист. Його ім\'я стоїть у пантеоні української історії як гетьман Війська Запорозького у вигнанні з 1710 по 1742 рік. Походив він зі шляхетного роду Орликів, які користувалися гербом "Новина".Одним з найбільш значущих внесків Пилипа Орлика в історію України було його участь у створенні "Договорів і постанов", які фактично були першою українською Конституцією. Цей конституційний акт став важливим кроком в утвердженні прав і свобод козацької держави та визнанні її незалежності. Легенда про Орлика та його внесок у становлення української державності триває й досі, засвідчуючи його значущість для українського народу.',
        "Посилання": "Пилип Орлик: примхлива доля Гетьмана-вигнанця&http://surl.li/uhvlt|1672 – народився Пилип Орлик, гетьман Війська Запорозького, співавтор першої Конституції&http://surl.li/uhvlw|Перший мазепинець і перший євроінтегратор&http://surl.li/uhvly",
        "Фото": "Орлик_Пилик_big.png |Орлик_Пилип_small.png"
       },
    {
    "Місяць": "Листопад",
    "Дата": "4 листопада",
    "Заголовок": "Дмитро-Роман Семенович Клячківський",
    "Стаття": "Народився 4 листопада 1911 року. Український військовий діяч, провідник ОУН м. Львова (друга полов. 1941), Крайовий Провідник ОУН ПЗУЗ (01.1942—02.1945); організатор і перший командир УПА на Волині (05.1943—11.1943), командир УПА-Північ (11.1943 — 02.1945), член ГВШ УПА. Полковник УПА (посмертно)",
    "Імя форми": "Воїн УПА та Провідник ОУН",
    "Стаття форми": "Дмитро-Роман Семенович Клячківський, народився 4 листопада 1911 року, відомий як видатний український військовий діяч та провідник Організації Українських Націоналістів. У другій половині 1941 року він взяв на себе роль провідника ОУН у Львові, де активно працював на користь національного визволення.Згодом, з 1942 по 1945 рік, Клячківський очолював ОУН у Підкарпатській землі, де він вів організаційну та бойову роботу. Відомий як організатор і перший командир УПА на Волині з травня по листопад 1943 року, а пізніше обіймав посаду командира УПА-Північ з листопада 1943 по лютий 1945 року. Його внесок у боротьбу за незалежність України був визнаний, і його звано полковником УПА посмертно. Дмитро-Роман Семенович Клячківський залишив невмирущий слід у історії боротьби українського народу за свободу та незалежність.",
    "Посилання": "КЛЯЧКІ́ВСЬКИЙ ДМИТРО-РОМАН СЕМЕНОВИЧ&http://surl.li/uhvme|День в історії - народився Дмитро Семенович Клячківський (Клим Савур)&http://surl.li/uhvmg",
    "Фото": "Клячкі́вський_Дмитро_big.png | Клячкі́вський_Дмитро_small.png"
    },
    {
    "Місяць": "Листопад",
    "Дата": "5 листопада",
    "Заголовок": "Дмитро Мирон-Орлик",
    "Стаття": "Псевдонім: «Максим Орлик», «Брюс», «Піп», «Роберт», «Андрій», «Свєнціцький». Народився 5 листопада 1911, с. Рай (нині Бережанський район, Тернопільська область) — 25 липня 1942 року, Київ. Відомий ідеолог та діяч ОУН, Крайовий провідник ОУН на Осередньо-Східних Українських Землях.",
    "Імя форми": "Герой ОУН та Визначний Ідеолог",
    "Стаття форми": "Дмитро Мирон-Орлик, відомий також під псевдонімами «Максим Орлик», «Брюс», «Піп», «Роберт», «Андрій», «Свєнціцький», народився 5 листопада 1911 року в селі Рай, що тепер належить до Бережанського району Тернопільської області. Він відомий як один із ключових ідеологів та діячів Організації Українських Націоналістів.У своїй ролі Крайового провідника ОУН на Осередньо-Східних Українських Землях, він вів активну боротьбу за незалежність та вільне майбутнє для українського народу. Його внесок у розвиток ідеології та стратегії боротьби був величезним, а його вірність ідеалам української національної самостійності визнана та шанована в усьому українському суспільстві. Життя і смерть Дмитра Мирона-Орлика стали символом непохитної віри у вільну Україну.",
    "Посилання": "Дмитро Мирон-Орлик – провідний діяч ОУН&http://surl.li/uhvmr|Дмитро Мирон&http://surl.li/uhvmt|Дмитро Мирон Орлик – відомий ідеолог та діяч ОУН&https://tobm.org.ua/myron-dmytro/",
    "Фото": "Мирон-Орлик_Дмитро_big.png | Мирон-Орлик_Дмитро_small.png"
    },
    {
    "Місяць": "Листопад",
    "Дата": "7 листопада",
    "Заголовок": "Нестор Іванович Махно",
    "Стаття": "Народився 7 листопада 1888 року, село Гуляйполе Олександрівського повіту Катеринославської губернії, Російська імперія (нині місто Гуляйполе, Запорізької області, Україна) — 25 липня — за іншими даними: 6 липня — 1934, Париж, Французька республіка. Український політичний і військовий діяч, командувач Революційної повстанської армії України, керівник селянського повстанського руху 1918—1921 років, відомий анархіст і тактик ведення.",
    "Імя форми": "Легенда Революційного Повстанця",
    "Стаття форми": "Нестор Іванович Махно, народився 7 листопада 1888 року в селі Гуляйполе Олександрівського повіту Катеринославської губернії, що зараз розташоване у Запорізькій області України. Він став відомий як український політичний і військовий діяч, визнаний командувач Революційної повстанської армії України.Махно відомий своїм відважним керівництвом селянським повстанським рухом протягом періоду 1918-1921 років. Він був відданим анархістом та майстерним тактиком у веденні бойових дій. Його ім'я стало символом суспільного протистояння та боротьби за справедливість серед селянського населення України під час періоду революції. Легенда про Нестора Махна продовжує жити в історії як символ боротьби за свободу та гідність.",
    "Посилання": "Батько Махно і українська анархія&http://surl.li/uhvnw|Український феномен Нестора Махна&https://tyzhden.ua/ukrainskyj-fenomen-nestora-makhna/|Останні роки життя Нестора Махна за кордоном (розсекречені документи)&https://www.radiosvoboda.org/a/nestor-makhno-dokumenty/31550088.html",
    "Фото": "Махно_Нестор_big.png | Махно_Нестор_small.png"
    },
    {
    "Місяць": "Листопад",
    "Дата": "8 листопада",
    "Заголовок": "Дмитро «Байда» Вишневецький",
    "Стаття": "Народився 8 листопада 1517 року — український магнат на Волині, князь гербу Корибут, козацький ватажок, гетьман. Власник маєтків у містечку Вишнівець Крем'янецького повіту. Збудований ним Хортицький замок на острові Мала Хортиця вважається прототипом Запорозької Січі.",
    "Імя форми": "Ватажок та Меценат Волині",
    "Стаття форми": 'Дмитро "Байда" Вишневе́цький, народився 8 листопада 1517 року, відомий як український магнат та князь гербу Корибут на Волині. Він також відомий як козацький ватажок та гетьман, заслужено носивший прізвисько "Байда".Провідником й організатором військових операцій, Вишневецький відіграв ключову роль у формуванні оборонної інфраструктури регіону. Його найвидатнішим досягненням була споруда Хортицького замку на острові Мала Хортиця, що стала прототипом для майбутньої Запорозької Січі. Завдяки його зусиллям та меценатству Запорозька Січ стала неприступною фортецею, що забезпечила захист від ворожих нападів та стала символом вільного козацького духу. Дмитро "Байда" Вишневе́цький залишив значний відбиток у військовій та культурній історії України, заслужено вважаючись одним із найвидатніших діячів свого часу.',
    "Посилання": "Дмитро Вишневецький  Біографія Цікаві факти&http://surl.li/uhvob|Засновник Запорізької Січі&http://surl.li/uhvod|Князь і гетьман: до 500-річчя від дня народження Дмитра (Байди) Вишневецького&http://surl.li/uhvof",
    "Фото": "Вишневе́цький_Байда_Дмитро_big.png |Вишневе́цький_Байда_Дмитро_small.png"
    },
    {
    "Місяць": "Листопад",
    "Дата": "25 листопада",
    "Заголовок": "Остафій Дашкевич",
    "Стаття": "Народився 1470 року — помер 25 листопада 1536. Руський боярин, староста черкаський, канівський та кричівський. Частиною істориків згадується як організатор козацьких загонів, засновник та перший кошовий отаман Війська Запорізького (1508).",
    "Імя форми": "Від Боярина до Першого Кошового Отамана",
    "Стаття форми": "Остафій Дашкевич, народився у 1470 році та помер 25 листопада 1536 року, був руським боярином, відомим старостою черкаським, канівським та кричівським. Його ім'я нерідко пов'язують з організацією козацьких загонів, а також вважають засновником та першим кошовим отаманом Війська Запорізького у 1508 році.Остафій Дашкевич відіграв важливу роль у формуванні та організації військових сил на теренах України. Він сприяв створенню козацьких загонів, які згодом виросли в могутню армію, відому своєю сміливістю та військовою майстерністю. Його внесок у формування козацького руху і загалом в історію України залишився незаперечним, роблячи його одним із визначних діячів свого часу.",
    "Посилання": "Остафій Дашкевич - один із батьків українського козацтва&http://surl.li/uhvol|Остафій Іванович Дашкевич (Дашкович)&https://kozaku.in.ua/getmanu/4-dashkevuch.html|Дашкевичі&https://uahistory.com/topics/famous_people/15287",
    "Фото": "Дашкевич_Остафій_big.png | Дашкевич_Остафій_small.png"
    },
    {
    "Місяць": "Грудень",
    "Дата": "12 грудня",
    "Заголовок": "Мельник Андрій Атанасович",
    "Стаття": "Народився 12 грудня 1890 року, Воля Якубова, Дрогобицький повіт, Королівство Галичини та Володимирії, Австро-Угорщина, нині Дрогобицький район, Львівська область, Україна — 1 листопада 1964 року, Кельн, ФРН. Український державний, військовий та політичний діяч. Полковник армії УНР, Голова Проводу Українських Націоналістів, другий голова ОУН (1938–1964). Один з найближчих соратників полковника та засновника ОУН Євгена Коновальця.",
    "Імя форми": "Архітектор Національного Руху",
    "Стаття форми": "Андрій Атанасович Мельник народився 12 грудня 1890 року у Волі Якубовій, що в Дрогобицькому повіті Королівства Галичини та Володимирії, у сучасному Дрогобицькому районі Львівської області, Україна. Він відомий як український державний, військовий та політичний діяч, чий внесок в утвердження національної ідеї був надзвичайно значимим.Андрій Мельник служив полковником в армії УНР та був головою Проводу Українських Націоналістів. Він також обіймав посаду другого голови Організації Українських Націоналістів з 1938 по 1964 рік. Його важливий внесок полягав у збереженні й розвитку національного руху, а також у співпраці з полковником Євгеном Коновальцем, засновником ОУН, що зміцнило позиції українського націоналізму. Андрій Мельник помер 1 листопада 1964 року у місті Кельн, ФРН, залишивши незабутній слід у історії боротьби за українську незалежність. Його життєвий шлях і діяльність є прикладом відданості і патріотизму, що надихає наступні покоління.",
    "Посилання": "Ірина Фаріон про Андрія Мельника — наступника Є. Коновальця&http://surl.li/uhvox|Андрій Мельник – борець за українську незалежність&http://ounb.km.ua/vistavki/andrmelnik/index.php|Андрій Мельник 1890 – 1964&https://www.museumsun.org/person/53/",
    "Фото": "Мельник_Андрій_big.png | Мельник_Андрій_small.png"
    },
    {
    "Місяць": "Грудень",
    "Дата": "14 грудня",
    "Заголовок": "Данило Апостол",
    "Стаття": "Народився 14 грудня 1654 року — помер 29 січня 1734 року. Український військовий, політичний і державний діяч. Гетьман Війська Запорозького, голова Гетьманщини на Лівобережній Україні (1727–1734). Представник козацького роду Апостолів волоського походження. Син Павла Апостола.",
    "Імя форми": "Символ Повстанського Духу",
    "Стаття форми": "Данило Апостол народився 14 грудня 1654 року, і його життя та діяльність запам'ятовані як символи боротьби за волю та незалежність українського народу. Він був визнаним українським військовим, політичним і державним діячем, відомим як гетьман Війська Запорозького та голова Гетьманщини на Лівобережній Україні з 1727 по 1734 рік. Данило Апостол був представником видатного козацького роду Апостолів, що мав волоське походження. Його батько, Павло Апостол, також відомий як видатний діяч козацької епохи. У спадок від свого батька, Данило успадкував не лише воєнні навички, а й патріотичні ідеали, що поклали початок його визначній кар'єрі.Під керівництвом Данила Апостола війська Запорозького проявили вражаючу міць та дуже впливливо змінили хід подій в історії України. Його приклад відданості і відваги залишає невиліковні сліди у пам'яті народу, а його ім'я залишається символом повстанського духу та боротьби за свободу. Данило Апостол помер 29 січня 1734 року, залишивши після себе незабутнє спадщину, яка продовжує надихати наступні покоління до боротьби за справедливість та самостійність.",
    "Посилання": "Данило Апостол. Розповіді про гетьманів та кошових отаманів України ч.23.&http://surl.li/uhvpg|Останній козак на гетьманській посаді: Данило Апостол і його доба&http://surl.li/uhvph|Гетьман-реформатор Данило Апостол&http://surl.li/uhvpi",
    "Фото": "Апостол_Данило_big.png | Апостол_Данило_small.png"
    },
    {
    "Місяць": "Грудень",
    "Дата": "20 грудня",
    "Заголовок": "Михайло Володимирович Омелянович-Павленко",
    "Стаття": "Народився 20 грудня 1878 року, Тифліс, Російська імперія — 29 травня 1952 року, Париж, Франція. Визначний український діяч, генерал-полковник Армії УНР, український воєначальник, до 1917 року полковник російської армії, за доби УНР — генерал армії УНР, Начальний командант УГА. Командував операціями Першого зимового походу (1920 року). Брат Івана Омеляновича-Павленка. Відповідно до українського законодавства може бути зарахований до борців за незалежність України у ХХ сторіччі.",
    "Імя форми": "Військовий Геній та Національний Герой",
    "Стаття форми": "Михайло Володимирович Омелянович-Павленко народився 20 грудня 1878 року в Тифлісі, колишньому центрі Грузії, що тоді належала Російській імперії. Він став одним із найвидатніших діячів української військової історії, заробивши визнання як генерал-полковник Армії УНР. Перш ніж приєднатися до боротьби за незалежність України, Омелянович-Павленко відслужив у російській армії, де досяг рангу полковника. Після утворення Української Народної Республіки він активно приєднався до військових справ.Його воєначальницький талант проявився в оперативному керівництві Першим зимовим походом у 1920 році, де його геніальна стратегія змусила противника визнати його майстерність. Омелянович-Павленко не тільки був військовим стратегом, але й національним героєм. Його життя й діяльність віддано служили ідеалам незалежності та волі українського народу. Помер Михайло Володимирович Омелянович-Павленко 29 травня 1952 року в Парижі, Франції, але його спадок залишився назавжди в серцях українців, що прагнуть до вільної та незалежної батьківщини.",
    "Посилання": "Михайло Омелянович-Павленко — командувач Першого Зимового походу&http://surl.li/uhvpq|Омелянович-Павленко Михайло Володимирович&http://surl.li/uhvps|Михайло Омелянович-Павленко – генерал-легенда&https://uain.press/blogs/984901-984901",
    "Фото": "Омелянович-Павленко_Михайло_big.png | Омелянович-Павленко_Михайло_small.png"
    },
    {
    "Місяць": "Грудень",
    "Дата": "27 грудня",
    "Заголовок": "Богдан (Зиновій-Богдан) Хмельницький",
    "Стаття": "Народився 27 грудня 1595 (6 січня 1596) — помер 27 липня (6 серпня) 1657. Політик, полководець і дипломат, провідник національно-визвольних змагань 1648—1657 років, творець Української козацької держави, гетьман Війська Запорозького. ",
    "Імя форми": "Гетьман і Творець Української Козацької Держави",
    "Стаття форми": "Богдан Хмельницький – легендарний діяч української історії, провідник національно-визвольних змагань XVII століття та засновник Української козацької держави. Народився він 27 грудня 1595 року (за старим стилем 6 січня 1596 року) і помер 27 липня (за старим стилем 6 серпня) 1657 року.Хмельницький відомий як видатний політик, полководець та дипломат. Почавши свою діяльність як козак, він став гетьманом Війська Запорозького, об'єднавши різні козацькі об'єднання. Його найвідомішим досягненням стала Батьківщина, перша українська держава, яка існувала протягом п'ятнадцяти років (1648-1657). Під його керівництвом козацькі війська відіграли значну роль у визволенні України від польської та турецької влади. Хмельницький був яскравою постаттю, яка залишила незабутні сліди в історії України, відігравши важливу роль у формуванні її державності та національної свідомості.",
    "Посилання": "Х/ф «Богдан-Зиновій Хмельницький»&http://surl.li/uhvqf|Гетьман Богдан-Зиновій Хмельницький - зрадник, маніяк чи герой?&http://surl.li/uhvqg|Богдан Хмельницький. Особистості в історії України&http://www.tsatu.edu.ua/biblioteka/17498/",
    "Фото": "Хмельницький_Богдан_big.png | Хмельницький_Богдан_small.png"
    },
    {
    "Місяць": "Грудень",
    "Дата": "29 грудня",
    "Заголовок": "Павло Полуботок",
    "Стаття": "Народився близько 1660 року — помер 29 грудня 1724, Петербург. Український військовий та політичний діяч. Чернігівський полковник, наказний гетьман Війська Запорозького Лівобережної України (1722-1724). Гетьман Глухівського періоду в історії України. Під час Північної війни виступив на боці Петра I. Заарештований за підписання Коломацьких чолобитних та супротив діяльності Малоросійської колегії. Помер в ув'язненні на території Петропавлівської фортеці.",
    "Імя форми": "Український Гетьман У Павутинні Імперської Влади",
    "Стаття форми": "Павло Полуботок, народився приблизно 1660 року та помер 29 грудня 1724 у Петербурзі, відомий як військовий та політичний діяч України. Він обіймав посаду чернігівського полковника та наказного гетьмана Війська Запорозького Лівобережної України з 1722 по 1724 рік. Полуботок став гетьманом у період, відомий як Глухівський, що відіграв важливу роль у внутрішніх справах України.Павло Полуботок активно діяв під час Північної війни, де виступав на боці Петра I. Проте його політична кар'єра припинилася через конфлікт з Малоросійською колегією та підписання Коломацьких чолобитних. В результаті він був заарештований та помер в ув'язненні на території Петропавлівської фортеці, залишивши позаду складну та переплетену історію.",
    "Посилання": "Гетьман Павло Полуботок&http://surl.li/uhvqn|Смерть Павла Полуботока&http://surl.li/uhvqp|Гетьман Павло Полуботок: магнат і видатний сміливець&http://surl.li/uhvqq",
    "Фото": "Полуботок_Павло_big.png | Полуботок_Павло_small.png"
    }
]
let CalendarData = {};
for(let i=0; i<sourceData.length; i++) {
    if(!CalendarData[sourceData[i]["Місяць"]])
        CalendarData[sourceData[i]["Місяць"]] = {}

    CalendarData[sourceData[i]["Місяць"]][sourceData[i]["Дата"].split(" ")[0]] = {
        "Заголовок": sourceData[i]["Заголовок"],
        "Стаття": sourceData[i]["Стаття"],
        "Імя форми": sourceData[i]["Імя форми"],
        "Стаття форми": sourceData[i]["Стаття форми"],
        "Посилання": sourceData[i]["Посилання"].split("|"),
        "Фото_Місяць": sourceData[i]["Фото"].split("|")[1].trim(),
        "Фото_День": sourceData[i]["Фото"].split("|")[0].trim(),
    }

}

export default CalendarData;